import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class KannadaGlobalService {

  constructor() { }
  public menu:any=[
    { title: "ರಾವಣ ಬ್ರಹ್ಮ", itemNumber: 0, pathName:"kannada-content",chapterNumber: 0, subs: null, icon: 'information', language:'kannada' },
    { title: "ಸಂಘ ಉದ್ದೇಶಗಳು", itemNumber: 1, pathName:"kannada-aims",chapterNumber: 0, subs: null, icon: 'information', language:'kannada' },
    { title: "ರಾವಣಬ್ರಹ್ಮ ದೇವಾಲಯಗಳು", itemNumber: 2, pathName:"kannada-temples",chapterNumber: 0, subs: null, icon: 'information', language:'kannada' },
    { title: "ವೀಡಿಯೊಗಳು", itemNumber: 3, pathName:"videos",chapterNumber: 0, subs: null, icon: 'information', language:'kannada' },
    { title: "ಹಾಡುಗಳು", itemNumber: 4, pathName:"songs",chapterNumber: 0, subs: null, icon: 'information', language:'kannada' },
    { title: "ಗ್ರಂಥಗಳು", itemNumber:5,pathName:"kannada-books",chapterNumber: 0, subs:null , icon: 'book-outline', language:'kannada' },
    { title: "ಪ್ರಿಂಟ್ ಮೀಡಿಯಾ", itemNumber:6,pathName:"print-media",chapterNumber: 0, subs:null , icon: 'information', language:'kannada' },
    //{ title: "ಪ್ರಶ್ನೆ ಉತ್ತರ", itemNumber:5,pathName:"question-answer",chapterNumber: 0, subs:null , icon: 'information', language:'kannada' },

  ]; 
  menuContent:any=[
    {
      text:`
  <ion-row>
  <ion-col class="ion-text-center" style="color:maroon;">
    <h1>ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣ ರಾವಣ ಬ್ರಹ್ಮ</h1><br>
  </ion-col>
</ion-row>
<p>
  ಆದಿ ( ದ್ರಾವಿಡ ) ಬ್ರಾಹ್ಮಣನು , ದೈವಜ್ಞಾನಿ , ತ್ರಿಕಾಲಜ್ಞಾನಿ ಅಪರಬ್ರಹ್ಮ , ತ್ರಿಗುಣಾತೀತನು , ಮೂರು ಯೋಗಗಳು . ಮೂರು ಆತ್ಮಗಳ ಜ್ಞಾನ ತಿಳಿದ ಯೋಗೀಶ್ವರನು , ದ್ರಾವಿಡೇಶ್ವರನು , ಮಹಾಮೇಧಾವಿ , ಭಗವಂತನಾದ ರಾವಣಬ್ರಹ್ಮ ವಿಶ್ರಾವಶನು ಮತ್ತು ಕೈಕಸಿಯರ ಪ್ರಥಮ ಸಂತಾನವಾಗಿ ಶ್ರೀಲಂಕ ರಾಜ್ಯದಲ್ಲಿ ರೈತ ಯೋಗ ( ತ್ರೇತಾಯುಗ ) ದಲ್ಲಿ ಜನಿಸಿದ್ದಾನೆ . 
<br><br>
ರಾವಣಬ್ರಹ್ಮ ಒಬ್ಬ ಸಾಧಾರಣ ವ್ಯಕ್ತಿಯಲ್ಲ , ಮಹಾಶಕ್ತಿ , ದೈವಶಕ್ತಿ , ರಾವಣಬ್ರಹ್ಮ ಜನ್ಮ ರಹಸ್ಯವಾದುದು . ಶ್ರೀಲಂಕಗೆ ಸುತ್ತಾ ಇರುವ ಇಂದೂ ಮಹಾಸಮುದ್ರದಲ್ಲಿ ಆ ದೈವಶಕ್ತಿ ಇದೆ . ಆ ದೈವಶಕ್ತಿ ಭೂಮಿಮೇಲೆ ದೈವಜ್ಞಾನ ಎಂದರೆ ಏನೊ ? ಯೋಗವೆಂದರೆ ಏನೊ ? ಕೊನೆಗೆ ಮೋಕ್ಷವೆಂದರೆ ಏನೊ ? ಒಂದು ನಮೂನೆಯನ್ನು ತೋರಿಸಬೇಕೆಂದು ಅಂದುಕೊಂಡಿದೆ . ಭೂಮಿಮೇಲೆ ಪ್ರಜೆಗಳಿಗೆ ಜ್ಞಾನ , ಯೋಗ , ಮೋಕ್ಷಗಳಿಗೆ ತಾರಾಣವಾಗಿ ಒಬ್ಬ ವ್ಯಕ್ತಿಯನ್ನು ಹುಟ್ಟಿಸಿ ಆತನನ್ನು ನೋಡುವುದರ ಮೂಲಕ ಎಲ್ಲರಿಗೂ ಪ್ರತ್ಯಕ್ಷ ಪ್ರಮಾಣವನ್ನು ತೋರಿಸಿದಂತಾಗುತ್ತದೆಂದು ತಿಳಿದ ದೈವಶಕ್ತಿ ತಾನೇ ಸ್ವಯಂವಾಗಿ ಒಂದು ತಾಯಿಗರ್ಭದಿಂದ ಹುಟ್ಟಿ ರಾವಣಬ್ರಹ್ಮ ಎಂದು ಹೆಸರುವಾಸಿಯಾಗಿದೆ . ಅಷ್ಟೇಯಾಗಲಿ ಆತನ ಜನನದಲ್ಲಿ ತಾಯಿತಂದೆಯರ ಪ್ರಮೇಯ ಇಲ್ಲ . ಹಾಗೆ ಬ್ರಹ್ಮನಾಗಿ ಕರೆಯಲ್ಪಟ್ಟ ಶಕ್ತಿ ನಿಜ ಜೀವನದಲ್ಲಿ ಜ್ಞಾನವನ್ನು , ಯೋಗವನ್ನು ರಾವಣನಿಂದ ತೋರಿಸಿದೆ . ಕೊನೆಯಲ್ಲಿ ಬ್ರಹ್ಮವಿದ್ಯೆಯಲ್ಲಿ ಹೇಳಿದ ಮೋಕ್ಷ ಹೊಂದುವುದಕ್ಕಿರುವ ನಿಯಮಗಳ ಪ್ರಕಾರ ಮರಣಿಸಿ ಮೋಕ್ಷವನ್ನು ಹೊಂದಿ . ಈ ವಿಧವಾಗಿಯೇ ಯಾವ ಮಾನವನಾದರೂ ಮೋಕ್ಷವನ್ನು ಹೊಂದಬೇಕು ಎಂದು ತೋರಿಸಿದೆ . ಇದರಿಂದ ರಾವಣಬ್ರಹ್ಮ ಎಂದರೆ ಸಾಧಾರಣ ವ್ಯಕ್ತಿ ಅಲ್ಲವೆಂದು ಆತನು ಒಂದು ಶಕ್ತಿ ಎಂದು ಜ್ಞಾನ , ಯೋಗ , ಮೋಕ್ಷಗಳನ್ನು ಜೀವನದಲ್ಲಿ ತಾರಾಣವಾಗಿ ತೋರಿಸಿದ ವ್ಯಕ್ತಿಯಾಗಿ ಕಾಣಿಸಿದ ಶಕ್ತಿಯೆಂದು ಅರ್ಥವಾಗುತ್ತಿದೆ .
<br><br>
 “ ರಾವಣ ” ಆತನ ಹೆಸರಾಗಿದ್ದು “ ಬ್ರಹ್ಮ ” ಎನ್ನುವುದು ಆತನ ಬಿರುದು . ಆಧ್ಯಾತ್ಮಿಕ ಅರ್ಥದ ಪ್ರಕಾರ ' ಬ್ರಹ್ಮ ' ಎಂದರೆ ದೊಡ್ಡದು ಎನ್ನುವ ಒಂದೇ ಒಂದು ಅರ್ಥ ಬರುತ್ತದೆ . ದೇವರು ಹೊರತು ಈ ವಿಶ್ವದಲ್ಲಿ ದೊಡ್ಡವರು ಯಾರೂ ಇಲ್ಲ . ಆದ್ದರಿಂದ ಬ್ರಹ್ಮ ಎಂಬ ಪದ ದೇವರಿಗೆ ಬದಲಿಹೆಸರಾಗಿ ಹೇಳಲಾಗುತ್ತಿದೆ . ರಾವಣ ಎಂಬ ಪದವನ್ನು ವಿಭಜಿಸಿ ನೋಡಿದರೆ ರ + ವಣ ಎಂದು ಎರಡಾಗಿ ಹೇಳಬಹುದು . ' ರ ' ಎಂದರೆ ನಾಶವನ್ನು ಸೂಚಿಸುವುದೆಂದು “ ವಣ ” ಅಂದರೆ ಅರಣ್ಯದಲ್ಲಿ ವೃಕ್ಷಗಳ ಸಮುದಾಯವೆಂದು ಅರ್ಥ ಬರುತ್ತದೆ . ರಾವಣ ಹೆಸರಿನಲ್ಲಿ ವಣವನ್ನು ನಾಶ ಮಾಡುವವನೆಂದು ಅರ್ಥ ಬರುತ್ತಿದೆ . ಮಾಯೆ ಎಂಬ ಅರಣ್ಯದಲ್ಲಿ , ಗುಣಗಳೆಂಬ ವೃಕ್ಷಗಳನ್ನು ನಾಶ ಮಾಡುವವನೆಂಬ ಅರ್ಥದಿಂದ ರಾವಣ ಹೆಸರಿದೆಯೆಂದು ತಿಳಿಯುತ್ತಿದೆ . ಆ ಕಾಲದಲ್ಲಿ ಮಾಯೆ ಎಂಬ ಅರಣ್ಯದಲ್ಲಿ ಸಮೂಲವಾಗಿ ನಾಶ ಮಾಡುವುದರಲ್ಲಿ ಎಲ್ಲರಿಗಿಂತ ದೊಡ್ಡವನಾದ್ದರಿಂದ ಆತನಿಗೆ ರಾವಣಬ್ರಹ್ಮ ಎಂದು ಹೆಸರು ಇಡುವುದು ನಡೆದಿದೆ . 
 <br><br>
“ ರಾವಣಬ್ರಹ್ಮ ಮಹಾ ಮೇಧಾವಿ . ಬ್ರಹ್ಮವಿದ್ಯಾ ಶಾಸ್ತ್ರ , ಜ್ಯೋತಿಷ್ಯಶಾಸ್ತ್ರ , ರಾಜನೀತಿ , ಆಯುರ್ವೇದ , ಸಂಗೀತ ಹೀಗೆ ಎಷ್ಟೋ ರಂಗಗಳಲ್ಲಿ , ಮೇಧಾವಿ , ಬಹುಮುಖ ಪ್ರಜ್ಞಾಶಾಲಿ ” ಎಂದು ಹೆಸರುಹೊಂದಿದ್ದಾರೆ . ಹತ್ತು ಮೇಧಾವಿ ತಲೆಗಳಿಗೆ ಇರುವ ಜ್ಞಾನಶಕ್ತಿ , ತಿಳುವಳಿಕೆಗಳು ಆತನಲ್ಲಿ ಕಾಣಿಸುತ್ತಿದ್ದವು ಆದ್ದರಿಂದ ಆತನನ್ನು ಆ ದಿನದ ಜ್ಞಾನಹಿರಿಯರು “ ದಶಕಂಠನು ” ಎಂದು ಗೌರವವಾಗಿ ಕರೆಯುತ್ತಿದ್ದರು . ಅಷ್ಟೇಯಾಗಲಿ ರಾವಣನಿಗೆ ಹತ್ತು ತಲೆಗಳಿವೆಯೆಂಬುದು ಪೂರ್ತಿ ಅಸತ್ಯ . ಸೂಕ್ಷ್ಮವಾಗಿ ದಶಕಂಠನೇ ಆಗಲಿ , ಭೌತಿಕವಾಗಿ ಎಲ್ಲರಿಗಿರುವಂತೆ ಒಂದು ತಲೆ ಮಾತ್ರವೇ ಇರುವುದು . 
<br><br>
ತ್ರೇತಾಯೋಗದಲ್ಲಿ ಇಂದೂ ಮಹಾಸಮುದ್ರ ದೈವಶಕ್ತಿಯಿಂದ ಕೂಡಿಕೊಂಡಿದೆಂದು ತಿಳಿದ ಒಬ್ಬೇ ಒಬ್ಬ ವ್ಯಕ್ತಿ ರಾವಣಬ್ರಹ್ಮ ಆದ್ದರಿಂದ ತರಡೂ ಆತನು ಸಮುದ್ರ ಸ್ನಾನ ಮಾಡುತ್ತಿದ್ದನು . ಇಂದೂ ಮಹಾಸಮುದ್ರದಲ್ಲಿ ಸ್ನಾನ ಮಾಡುವುದರಿಂದ ದೈವಶಕ್ತಿ ತಲೆಯಲ್ಲಿ ಸೇರುತ್ತದೆಂದು ಆ ದಿನವೇ ರಾವಣಬ್ರಹ್ಮನಿಗೆ ಗೊತ್ತು . ಆ ದಿನ ಅಷ್ಟು ಶಕ್ತಿ ಇಂದೂಮಹಾಸಮುದ್ರದಲ್ಲಿ ಇತ್ತು . ಆದರೆ ಈದಿನ ಆ ಶಕ್ತಿ ಅಲ್ಲಿಯಿಲ್ಲ . ತ್ರಿಕಾಲಜ್ಞಾನಿಯಾದ ರಾವಣಬ್ರಹ್ಮ ಆ ಸಮುದ್ರಕ್ಕೆ  ಜ್ಞಾನ ಚಿಹ್ನೆಯಾಗಿ “ ಇಂದು ” ಎಂದು ಹೆಸರಿಟ್ಟು ಆತನು ಮರಣಿಸಿದ ನಂತರ ಕೂಡಾ ಆತನ ಆತ್ಮಶಕ್ತಿಯನ್ನು , ಇಂದೂ ಮಹಾಸಮುದ್ರದಲ್ಲಿಯೇ ಇರುವಂತೆ ಮಾಡಿದ್ದಾರೆ . ನಂತರ ಕಾಲದಲ್ಲಿ ದೇಶದ ಹೆಸರು ಬದಲಿಸಿ “ ಹಿಂದೂ ” ಮಾಡಿ , ಸಮುದ್ರದ ಹೆಸರನ್ನು “ ಹಿಂದೂ ” ಮಾಡುವುದರಿಂದ ಆ ರಾವಣಬ್ರಹ್ಮನ ಆತ್ಮಶಕ್ತಿ ಈ ಸಮುದ್ರವನ್ನೆ ಬಿಟ್ಟುಹೋಗಿ ಈ ದಿನ ಅಮೇರಿಕಾ ಹತ್ತಿರವಿರುವ ಅಟ್ಲಾಂಟಿಕ್ ಸಮುದ್ರದಲ್ಲಿ ಸೇರಿಹೋಗಿದೆ . ಆ ದಿನ ಜೀವಾತ್ಮ , ಆತ್ಮ , ಪರಮಾತ್ಮ ಎಂಬ ಶ್ರಿತ ಜ್ಞಾನವನ್ನು ತಿಳಿದ ರಾವಣಬ್ರಹ್ಮನ ಆತ್ಮಶಕ್ತಿ ಅದೇ ತೈತ ಸಿದ್ಧಾಂತಕ್ಕೆ ಗುರುತಾಗಿ ಸಮುದ್ರದಲ್ಲಿ ಮೂರು ಕೋನಗಳಶಕ್ತಿಯಾಗಿ ವ್ಯಾಪಿಸಿ ಈದಿನ “ ಬೆರುಡಾ ಟ್ರಯಾಂಗಿಲ್ ” ಆಗಿ ಹೆಸರುವಾಸಿಯಾಗಿದೆ . ಆತನ ಜೀವನವು ಜನನದಿಂದ ಮರಣದ ವರೆಗೂ ಬ್ರಹ್ಮವಿದ್ಯಾಶಾಸ್ತ್ರ ಪ್ರಾಮಾಣಿಕವಾಗಿಯೇ ನಡೆದು , ಸರ್ವಜೀವರಾಶಿಗಳಿಗು ಮಾರ್ಗದರ್ಶಕವಾಗಿ ನಿಂತಿದೆ . ಆ ದೈವಶಕ್ತಿಯೇ , ಆತ್ಮಶಕ್ತಿಯಾಗಿ , ಚೈತನ್ಯಶಕ್ತಿಯಾಗಿ ತ್ರೇತಾಕಾರಶಕ್ತಿಯಾಗಿ ಪ್ಲಾರಿಡಾ ಹತ್ತಿರ ಬೆರುಡಾ ಟ್ರಯಾಂಗಿಲಾಗಿ ಇವತ್ತಿಗೂ ಇದೆ . ಉತ್ತರ ಅಟ್ಲಾಂಟಿಕ್ ಸಮುದ್ರದಲ್ಲಿ ಒಂದು ಕಡೆಯಿರುವ ಈ ಶಕ್ತಿ , ಭೂಮಂಡಲವೆಲ್ಲಾ ವ್ಯಾಪಿಸಿ ಪ್ರಕೃತಿ ಭಾಗಗಳಾದ ಪಂಚಭೂತಗಳಿಗೆ ಚೈತನ್ಯಕೊಟ್ಟು ಯಾವಾಗ , ಎಲ್ಲಿ , ಯಾವ ವಿಧವಾಗಿ ಅವುಗಳನ್ನು ಕೆಲಸ ಮಾಡಿಸಬೇಕೊ , ಆ ವಿಧವಾಗಿಯೇ ಕೆಲಸ ನಡೆಯುವಂತೆ ಮಾಡುತ್ತಿದೆ . 
<br><br>
ಈಶ್ವರನು ಎಂದರೆ ಅಧಿಪತಿ , ವಿಶ್ವಕ್ಕೆ ಅಧಿಪತಿಯಾದ ನಿರಾಕಾರನಾದ ಪರಬ್ರಹ್ಮ ಪುರುಷೋತ್ತಮನಿಗೆ ಮಾರುರೂಪವಾದ ಈಶ್ವರಲಿಂಗವನ್ನೆ ರಾವಣಬ್ರಹ್ಮ ಪೂಜಿಸಿದ್ದಾರೆ . ಸಕಲ ಮಾನವಜಾತಿಗೆ ನಿರಾಕಾರ ಪರಮಾತ್ಮನನ್ನು ಯಾವ ವಿಧವಾಗಿ ಪೂಜಿಸಬೇಕೊ ತಿಳಿಸುವುದಕ್ಕೋಸ್ಕರ ತಾನು ಈಶ್ವರಲಿಂಗ ಆರಾಧನೆ ಮಾಡಿ ನಮಗೆ ಮಾರ್ಗದರ್ಶಕವಾಗಿ ನಿಂತಿದ್ದಾರೆ . ಅಷ್ಟೇಯಾಗಲಿ ತಾನು ಎಂದಿಗೂ ಅನ್ಯದೇವತಾರಾಧನೆ ಮಾಡಲಿಲ್ಲ ಅಂತಹ ಆರಾಧನೆಗಳನ್ನು ಖಂಡಿಸಿದ್ದಾರೆ . ಯೋಗವನ್ನು ಹೊರತು ತಪಸ್ಸು ಮಾಡುವವನು ಅಲ್ಲ . 
<br><br>
ಸುರರು ಎಂದರೆ ಸುರಾಪಾನ ಮಾಡುವವರೆಂದು , ಅಸುರರು ಎಂದರೆ ಸುರಾಪಾನ ಮಾಡದವರೆಂದು ಅರ್ಥ . ಅದಕ್ಕೆ ರಾವಣಬ್ರಹ್ಮನನ್ನು ಎಂತಹ ಕೆಟ್ಟ ಅಭ್ಯಾಸ ಇಲ್ಲದವನೆಂದು ಹೇಳುವುದಕ್ಕೆ ಆತನನ್ನು ರಾವಣಾಸುರ ಎಂದು ಆ ದಿನದ ಜ್ಞಾನಹಿರಿಯರು ಸಂಬೋಧಿಸುತ್ತಿದ್ದರು . ಆದರೆ ಆತನೊಂದಿಗೆ ಶತ್ರುತ್ವ ಇರುವ ಆರ್ಯರು ಅಸುರ ಎಂಬ ಪದವೊಂದರ ಅರ್ಥ ಬದಲಾವಣೆಮಾಡಿ ಅಸುರ ಎಂದರೆ ರಾಕ್ಷಸ ಎಂದು ಭಾಷ್ಯ ಹೇಳಿದ್ದಾರೆ . ಉಳಿದ ಮಾನವಜಾತಿ ಅದೇ ನಿಜವೆಂದು ನಂಬಿದ್ದಾರೆ . ಉನ್ನತ ವಂಶದಲ್ಲಿ ಹುಟ್ಟಿದಂತಹ ವ್ಯಕ್ತಿ “ ರಾವಣ ” , ಆತನನ್ನು “ ಪೌಲಸ್ಯಬ್ರಹ್ಮ ” ಎಂದು ಕೂಡಾ ಕರೆಯುತ್ತಾರೆ . ಆತನ ಬ್ರಹ್ಮತ್ವವನ್ನು ಹರಿತ ಅಸಲಾದ ದ್ರಾವಿಡ ಬ್ರಹ್ಮಣನು . ಆತನು ರಾಕ್ಷಸನು ಹೇಗೆ ಆಗಿದ್ದಾನೆ ? 
<br><br>
ರಾವಣಬ್ರಹ್ಮನೊಂದಿಗೆ ಆರ್ಯರು , ಶತ್ರುತ್ವಕ್ಕೆ ಮುಖ್ಯಕಾರಣ ವೇನೆಂದರೆ ಆರ್ಯರು ಪ್ರೋತ್ಸಾಹಿಸಿದ 4 ಅಧರ್ಮಗಳನ್ನು ( ಯಜ್ಞಾಚರಣ , ಮಂತ್ರಪಠನ , ತಪಸ್ಸುಗಳು , ದಾನಗಳು ) ದ್ರಾವಿಡೇಶ್ವರನು ಖಂಡಿಸುತ್ತಿದ್ದರು . ಅವುಗಳ ಆಚರಣೆಯನ್ನು ಆಟಂಕಪಡಿಸುತ್ತಿದ್ದರು . ಮೂರು ಧರ್ಮಗಳಾದ ಬ್ರಹ್ಮಯೋಗ , ಕರ್ಮಯೋಗ , ಭಕ್ತಿಯೋಗಗಳನ್ನು ಪ್ರೋತ್ಸಾಹಿಸುತ್ತಿದ್ದರು . ಬ್ರಹ್ಮವಿದ್ಯಾಶಾಸ್ತ್ರದ ಪ್ರಕಾರ ಮೇಲೆ ಹೇಳಿದ 4 ಅಧರ್ಮಗಳು ದೈವಮಾರ್ಗ ಎಂದರೆ ಮೋಕ್ಷ ಮಾರ್ಗಕ್ಕೆ ವ್ಯತಿರೇಕವೆಂದು , ಮೂರು ಧರ್ಮಗಳ ಆಚರಣೆಯೇ ಮೋಕ್ಷಕ್ಕೆ ಮಾರ್ಗವೆಂದು ತಿಳಿಸಿದ ರಾವಣಬ್ರಹ್ಮ ಅಧರ್ಮಗಳನ್ನು ಖಂಡಿಸುವುದರಿಂದ ಅದು ಗಿಟ್ಟದ ಆರ್ಯರು ಆತನಮೇಲೆ ದುಷ್ಟಚಾರ ಮಾಡುತ್ತಿದ್ದರು . ಅಧರ್ಮಗಳಾದ ಯಜ್ಞಯಾಗಾದಿಗಳನ್ನು , ವೇದಗಳ ಅಧ್ಯನವನ್ನು , ತಪಸ್ಸು , ದಾನಗಳನ್ನು ಪ್ರವೇಶವಿಟ್ಟು , ದೈವಜ್ಞಾನ ಕಲುಷಿತ ಮಾಡಬೇಕೆಂದು ನೋಡಿದ ಆರ್ಯರ ಪ್ರಯತ್ನವನ್ನು ಎದುರಿಸಿ ಇವು ಅಧರ್ಮಗಳೆಂದು ಹೇಳುವುದರಿಂದ , ಈತನು ಧರ್ಮಗಳಗ್ಲಾನಿ ಆದ ಜ್ಞಾನಕಲುಷಿತವನ್ನು ತೆಗೆದುಹಾಕುವುದಕ್ಕೆ ಬಂದಿರುವ ಭಗವಂತನೆಂದು ತಿಳಿಯಬಹುದು .
<br><br>
 “ ಬ್ರಹ್ಮಜ್ಞಾನ ಇರುವವರನ್ನು ಬ್ರಾಹ್ಮಣರು ಅನ್ನಬೇಕು " . ಬ್ರಹ್ಮಜ್ಞಾನವನ್ನನುಸರಿಸಿ ಯಾವ ಮನುಷ್ಯನಾದರೂ ಬ್ರಾಹ್ಮಣನು ಎಂದು ಕರೆಯಲ್ಪಡುತ್ತಾನಾಗಲಿ ಕುಲದಲ್ಲಿ ಬ್ರಾಹ್ಮಣಕುಲ ಎಂಬುದು ಇಲ್ಲವೇ ಇಲ್ಲ . ಮೂರು ಆತ್ಮಗಳ ಜ್ಞಾನ ತಿಳಿದವರು ಯಾರಾದರೂ ಇದ್ದರೆ ಅವರನ್ನು ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣರು ಎಂದು ಹೇಳಬಹುದು . ಸಂಪೂರ್ಣಜ್ಞಾನಿಯಾದ ರಾವಣಬ್ರಹ್ಮ   ಸ್ವಚ್ಛವಾದ ಬ್ರಾಹ್ಮಣನು . ದೇಶಕ್ಕೆ ರಾಜನಾಗಿರುವುದರಿಂದ ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣರೆಲ್ಲರಿಗೂ ನಾಯಕನಾಗಿದ್ದು ಬ್ರಾಹ್ಮಣರಲ್ಲಿ ದೈವಭಕ್ತಿ , ಜ್ಞಾನಶಕ್ತಿ ಕಡಿಮೆಯಾಗದಂತೆ ನೋಡಿಕೊಳ್ಳುತ್ತಿದ್ದರು . ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣ ಯಾರಾಗಲಿ ಅಜ್ಞಾನದೊಳಗೆ ಹೋಗದಂತೆ , ಮೂರು ಆತ್ಮಗಳ ಜ್ಞಾನದಲ್ಲಿ ಇರುವಂತೆ , ಎಷ್ಟೋ ಜ್ಞಾನಶಕ್ತಿಗೆ ನಿಲಯವಾಗಿರುವಂತೆ ರಾವಣನು ಪರ್ಯವೇಕ್ಷಿಸುತ್ತಿದ್ದನು . ಶ್ರೀಲಂಕದಲ್ಲಿ ಇರುವವರಿಗೆ ರೋಗಗಳು ಸಹಿತವು ಭಯಪಡುತ್ತಿದ್ದವು . ಯಾವ ರೋಗವಾಗಲಿ ಲಂಕೆ ದರಿದಾಮಗಳಿಗೆ ಹೋಗುವುದಲ್ಲ . ತ್ರೇತಯೋಗದಲ್ಲಿ ಬಂದಿರುವ ದೈವಾಂಶವಾದ ರಾವಣಬ್ರಹ್ಮ ತನ್ನ ಬುದ್ಧಿಬಲವನ್ನು ಮಂತ್ರಶಕ್ತಿಯಾಗಿ ಬದಲಿಸಿ ಪುಷ್ಪಕ ವಿಮಾನವನ್ನು ತಯಾರು ಮಾಡಿ ಅದರಲ್ಲಿ ವಿವಿಧ ಪ್ರಾಂತಗಳಿಗೆ ಪ್ರಯಾಣಿಸಿ ಬ್ರಹ್ಮಜ್ಞಾನವನ್ನು ಎಲ್ಲರಿಗೂ ಸೇರಿಸಿದ್ದಾನೆ . 
 <br><br>
ಈ ವಿಧವಾಗಿ ದಕ್ಷಿಣ ಭಾರತದೇಶವೆಲ್ಲಾ ರಾವಣಬ್ರಹ್ಮ ಆಧೀನದಲ್ಲಿದ್ದು , ಪ್ರತಿಯೊಬ್ಬರೂ ಜ್ಞಾನವಂತವಾಗಿ ನಡೆದುಕೊಳ್ಳುತ್ತಿದ್ದರು . ಯಾರಾದರೂ ಕೋರಿಕೆಗಳಿಗೋಸ್ಕರ ಯಜ್ಞಗಳು ಮಾಡಿದಾಗ ರಾವಣಬ್ರಹ್ಮ ಅನುಚರರು ಬಂದು ಭಂಗಮಾಡಿದಾಗ , ಆ ಯಜಗಳಿಗಧಿಪತಿಗಳಾಗಿ ಇರುವ ಗ್ರಹಶಕ್ತಿಗಳು ರಾವಣಬ್ರಹ್ಮ ಅನುಚರರನ್ನು ಯಾಮಾತ್ರ ಅಡ್ಡಿಕೊಳ್ಳದೆ ಅವರಿಗೆ ಮದ್ದು ತಿಳಿಸುತ್ತಿದ್ದವು . ಆರ್ಯರ ಪೋದ್ದಲದಿಂದ ಯಾರಾದರೂ ಅಂತಹ ಅಧರ್ಮ ಆರಾಧನೆಗಳು ಮಾಡಿದರೆ ಅವರನ್ನು ರಾವಣಬ್ರಹ್ಮ , ಆತನ ಸೈನ್ಯ ಅಡ್ಡಿಕೊಳ್ಳುವುದು ನಡೆಯುತ್ತಿತ್ತು . ಲಂಕೇಶ್ವರನು ಆರ್ಯರ ಪಾಲಿಗೆ ಯಮನಂತೆ ಕಾಣಿಸಿದ್ದಾನೆ . ದಕ್ಷಿಣ ಭಾರತದೇಶದಲ್ಲಿ ಆರ್ಯರು , ತಮ್ಮ ಆರ್ಯ ಪ್ರಾಭವವನ್ನು ಬೆಳೆಸಿಕೊಳ್ಳುವುದಕ್ಕೆ ಯಜ್ಞಯಾಗಾದಿಗಳನ್ನು , ವೇದ ಅಧ್ಯನಗಳು ಹೆಚ್ಚಾಗಿ ಮಾಡುತ್ತಿದ್ದರು . ಆ ಕ್ರಮದಲ್ಲಿ ಯೋಗರಕ್ಷಣೆಗೆ ರಾಮನನ್ನು ವಿಶ್ವಾಮಿತ್ರನು ತೆಗೆದುಕೊಂಡು ಹೋಗುವುದು ನೆಡೆದಿದೆ . ಚಿಕ್ಕವಯಸ್ಸಿನಲ್ಲಿ ಎಂತಹ ಬ್ರಹ್ಮಜ್ಞಾನ ಇಲ್ಲದ ರಾಮನು ಯಜ್ಞರಕ್ಷಣೆಗೆ ಹೋಗಿ , ಅಧರ್ಮವನ್ನು ಅಡ್ಡುಕೊಂಡ ರಾವಣನ ಅನುಚರರನ್ನು ಅನ್ಯಾಯವಾಗಿ ಸಾಯಿಸುವುದು ನಡೆದಿದೆ . ರಾಮನು ಹುಟ್ಟದ ಪೂರ್ವದಿಂದಲೇ ಇರುವ ಆರ್ಯರ , ದ್ರಾವಿಡರ ವೈರ್ಯವು ಈ ಸಂಘಟಣೆಯಿಂದ ಇನ್ನೂ ತೀವ್ರವಾಗಿದೆ . ಇವು ಚರಿತ್ರೆಗೇರಿದ ವಾಸ್ತವಗಳು . 
<br><br>
ರಾಮಾಯಣ ಚರಿತ್ರೆಯನ್ನು ಗ್ರಂಥರೂಪವಾಗಿ ಬರೆದ ಆರ್ಯನಾದ ವಾಲ್ಮೀಕಿ ರಾವಣಬ್ರಹ್ಮನನ್ನು ದುರ್ಮಾರ್ಗನು , ಕಾಮಾಂಧಕಾನು ಎಂದು ಬರೆಯುವುದು ನಡೆದಿದೆ . ಆ ದಿನ ರಾವಣನು ಸೀತೆಯನ್ನು ತೆಗೆದುಕೊಂಡು ಹೋಗಿರುವುದು ವಾಸ್ತವವೇ ಆದರೂ , ಆತನು ಯಾವ ಉದ್ದೇಶದಿಂದ ತೆಗೆದುಕೊಂಡು ಹೋಗಿದ್ದಾನೊ ತಿಳಿಯದಂತೆ ಮಾತನಾಡಿದರೆ ನಮಗೆ ವಿಚಕ್ಷಣೆ ಇಲ್ಲದಂತೆ , ಇಚ್ಛಾಮರಣ ಇರುವ ರಾವಣಬ್ರಹ್ಮ , ರಾಮನ ಕೈಯಲ್ಲಿ ತನ್ನ ಸಾವು ಇದೆಯೆಂದು , ಹಾಗೆ ನಡೆಯುವುದಕ್ಕೆ ಸೀತೆಯನ್ನು ಲಂಕೆಗೆ ತೆಗೆದುಕೊಂಡು ಬರದಿಂಬ ವಿಷಯವನ್ನು ತನ್ನ ಪತ್ನಿ ಮಂಡೋದರಿ ದೇವಿಗೆ ಮೊದಲೇ ಹೇಳಿದ್ದಾನೆ . ಆ ವಿಷಯಗಳು ಪಕ್ಕಕಿಟ್ಟು ಸೀತೆಯನ್ನು ದುರುದ್ದೇಶದಿಂದ ರಾವಣನು ಲಂಕೆಗೆ ತೆಗೆದುಕೊಂಡು ಹೋಗಿದ್ದಾನೆಂದು ಆರ್ಯರು ಕೆಟ್ಟದಾಗಿ ಪ್ರಚಾರ ಮಾಡಿ ಬರೆದಿದ್ದಾರೆ . 80 ಸಂ ॥ ಮೇಲಿರುವ ವೃದ್ಧಾಪ್ಯದಲ್ಲಿರುವ ರಾವಣನು ಎಷ್ಟೋ ಅನುಭವಶಾಲಿ , ಮೇಧಾವಿ ಆಗಿರುವುದರಿಂದ ಸುಮಾರು ಎರಡು ನೂರು ಸಂಖ್ಯೆಯಲ್ಲಿ ಸ್ತ್ರೀಯರನ್ನು ಸೀತೆಗೆ ಪರಿಚರ್ಯಗಳು ಮಾಡುವು ದಕ್ಕೆ ಜೊತೆಯಾಗಿರುವುದಕ್ಕೂ ಏರ್ಪಾಡು ಮಾಡಿ ಒಳ್ಳೆಯ ವಾತಾವರಣಕ್ಕೋಸ್ಕರ ಸೀತೆಯನ್ನು ತನ್ನ ನಿವಾಸಕ್ಕೆ 50 ಕಿ.ಮಿ ದೂರದಲ್ಲಿರುವ ಉದ್ಯಾನವನದಲ್ಲಿ ಇಟ್ಟಿದ್ದಾನೆ . ವಾರಕ್ಕೆ ಒಂದುಬಾರಿ ಸತಿಸಮೇತನಾಗಿ ಅಶೋಕವನಕ್ಕೆ ಹೋಗಿ ಒಬ್ಬ ತಂದೆಯಂತೆ ಮಾತನಾಡಿಸಿ ಸೀತೆಯ ಆರೋಗ್ಯ ವಿಷಯಗಳು ತಿಳಿದುಕೊಂಡು ಆಕೆಗೆ ಯಾವಕೊರತೆ ಇಲ್ಲದಂತೆ ನೋಡಿರೆಂದು ತನ್ನವರಿಗೆ ಹೇಳಿಬರುತ್ತಿದ್ದನು . ಸೀತೆಗೆ ನಡೆಯುವಂತಹ ವಿಷಯಗಳು ಮೊದಲೆ ಹೇಳಿ , ರಾಮನು ತನ್ನ ಕಾರಣದಿಂದ ಇಲ್ಲಿಗೆ ಬರಬೇಕಾಗಿದೆಂದು , ತನ್ನ ಮರಣ ಯಾವಾಗ ನಡೆಯುತ್ತದೊ ಕೂಡಾ ಮೊದಲೇ ಸೀತೆಗೆ ಹೇಳಿದ್ದಾನೆ . ರಾಮನು ಎಂತಹ ಮನಸ್ಥತ್ವ ಇರುವವನೊ ನಡೆಯುವಂತಹ ಕಾಲದಲ್ಲಿ ನಿನಗೆ ತಿಳಿಯುತ್ತದೆಂದು ಕೂಡಾ ಸೀತೆಗೆ ಹೇಳಿದ್ದಾನೆ . ಸೀತೆ ಯಾವಾತ್ತು ರಾವಣನು ಕೆಟ್ಟವನೆಂದು ಆರೋಪಣೆ ಮಾಡಲಿಲ್ಲ . ಸುಮಾರು ಹನ್ನೊಂದು ವರ್ಷಗಳು ವಾಲ್ಮೀಕಿ ಆಶ್ರಮದಲ್ಲಿರುವ ಸೀತೆ ಯಾವ ಸೌಕರ್ಯವಿಲ್ಲದ ಕುಟೀರದಲ್ಲಿ ಅನೇಕ ಬಾಧೆಗಳುಬಿದ್ದು , ಹತ್ತುತಿಂಗಳು ರಾವಣನ ಕಾಲದಲ್ಲಿ ಲಂಕೆಯಲ್ಲಿರುವಾಗಲೇ ಯಾವ ಕಷ್ಟ ಇಲ್ಲದಂತೆ ನಡೆದಿರುವುದನ್ನು ಎಷ್ಟೋಬಾರಿ ಅಂದುಕೊಂಡಿದ್ದಾಳೆ . ಸೀತೆ ಯಾವದಿನವೂ ರಾವಣನು ಕೆಟ್ಟವನೆಂದು ಹೇಳದೆಹೋದರೂ , ರಾಮಾಯಣ ಬರೆದವರು ಆರ್ಯರಾಗಿರುವುದರಿಂದ     ಆರ್ಯರು ಬದುಕುಬಾಳಿಗಾಗಿ ಭಾರತದೇಶಕ್ಕೆ ವಲಸೆ ಬರುವುದು ನಡೆದಿದೆ . ಹಾಗೆ ಬದುಕಬಾಳಿಗೆ ವಲಸೆ ಬಂದಿರುವ ಆಸೀಯರೇ ದೇವರ ಧರ್ಮಗಳಿಗು , ಜ್ಞಾನಕ್ಕು ಹತ್ತಿರವಾಗಿರುವ ದ್ರಾವಿಡರನ್ನು ವಂಚನೆಯಿಂದ ದೌರ್ಜನೆಯಿಂದ ಆಕ್ರಮಣ ಮಾಡಿಕೊಳ್ಳುವುದು ನಡೆದಿದೆ . ಅವರೆ ಈದಿನ ಆರ್ಯರಾಗಿ ಕರೆಯಲ್ಪಡುತ್ತಿರುವವರು . ಆರ್ಯರೊಂದರ ಬರುವಿಕೆಯಿಂದ ಅಮಾಯಕರಾದ ದ್ರಾವಿಡರು ತಮ್ಮ ಸ್ವಯಂಪ್ರತಿಪತ್ತಿಯನ್ನು ಕಳೆದುಕೊಂಡು , ದೈವಜ್ಞಾನಕ್ಕೆ ದೂರವಾಗಿ ಆಸೀಯರ ಕುತಂತ್ರಗಳಿಗೆ ಬಲಿಯಾಗಿ , ಅಧರ್ಮಗಳನ್ನು ದ್ರಾವಿಡರಮೇಲೆ ರುದ್ದುವುದು ನಡೆದಿದೆ . ಆದ್ದರಿಂದ ಕ್ರಮಕ್ರಮವಾಗಿ ದ್ರಾವಿಡರು ತಮ್ಮ ಸ್ಥಿತಿಯನ್ನು ಕಳೆದುಕೊಂಡು , ದ್ರಾವಿಡರೆಂಬ ಸ್ಪಹ ಕಳೆದುಕೊಳ್ಳುವ ಸ್ಥಿತಿಗೆ ಸೇರಿಕೊಂಡಿದ್ದಾರೆ . 
<br><br>
ದ್ರಾವಿಡ ದೇಶದಲ್ಲಿ ಅಂತರ್ಭಾಗವಾದ ಶ್ರಿಲಂಕದಲ್ಲಿ ರಾವಣಬ್ರಹ್ಮ ಪಾಲನೆಯಲ್ಲಿನ ಪ್ರಜೆಗಳಾಗಿ ಕರೆಯಲ್ಪಡುತ್ತಿರುವವರು ಇವತ್ತಿಗೂ .. ಎಂದಿಗಾದರೂ ರಾವಣಬ್ರಹ್ಮ ತಿರುಗಿಬರುತ್ತಾನೆ . ಆತನಿಗೆ ಮರಣವಿಲ್ಲ , ಆತನು ಯಾವತ್ತಿಗಾದರೂ ಮನಃ ಬಂದು ಧರ್ಮವನ್ನು ಸ್ಥಾಪಿಸುತ್ತಾನೆಂದು ವಿಶ್ವಸಿಸುತ್ತಿದ್ದಾರೆ . ನಾವು ಹೇಳುವುದೂ ಕೂಡಾ ಅದೇ ಆತ್ಮಶಕ್ತಿಯಾಗಿ ತ್ರೇತಾಕಾರ ಶಕ್ತಿಯಾಗಿ ( ಬೆರುಡಾ ಟ್ರಯಾಂಗಲ್‌ನಲ್ಲಿರುವ ಆತನ , ಧರ್ಮಗಳು ಪುನರುದ್ಧರಿಸುವುದಕ್ಕೆ ಮತ್ತೆ ಅವತರಿಸುತ್ತಾನೆಂದು , ಆತನು ಜೀವಿಯಲ್ಲಿ ಆತನಿಗೆ ಮರಣ ಇಲ್ಲವೆಂದು ಆದಕಾರಣ ಮರೆಯಾಗಿಹೋಗಿರುವ ಸತ್ಯವನ್ನು ಹೊರಗೆ ತೆಗೆದು ರಾವಣಬ್ರಹ್ಮ ಅಜ್ಞಾನಿಯಲ್ಲಿ ಸಂಪೂರ್ಣ ದೈವಜ್ಞಾನಿ ಎಂದೂ , ಆತನು ದುರ್ಮಾರ್ಗನು ಅಲ್ಲ ಸನ್ಮಾರ್ಗನು ಎಂದೂ , ಆತನು ಶೂದ್ರನು ಅಲ್ಲ ನಿಜವಾದ ಸದಾಹಣನೆಂದೂ , ಆತನು ಸಾಮಾನ್ಯನಲ್ಲ ದೈವಧರ್ಮಗಳು ಪುನರುದ್ಧರಿಸುವುದಕ್ಕೆ ಅವತರಿಸಿದ ಯೋಗೀಶ್ವರನು . ಭಗವಂತನು ಎಂದೂ ತಿಳಿಸಬೇಕೆಂದುಕೊಂಡಿದ್ದೇವೆ . ತಿಳಿಸುತ್ತಿದ್ದೇವೆ . 
<br><br>ಇಗೆ <br><br>
<h1>ರಾವಣ ಬ್ರಹ್ಮ ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣ ಸಂಗ</h1>
</p>
  `},
  {
    text:`
    <ion-row>
    <ion-col class="ion-text-center">
    <h1> <b> ರಾವಣಬ್ರಹ್ಮ ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣ ಸಂಘ </b></h1>
    </ion-col></ion-row>
    <ion-row>
    <ion-col class="ion-text-center">
    <h1> <b>  ಮುಖ್ಯ ಉದ್ದೇಶಗಳು </b></h1>
    </ion-col></ion-row>
   
    <br>
    1. ವಿಶ್ವ ಸೃಷ್ಟಿಕರ್ತನಾದ ದೇವರು ಎಲ್ಲರಿಗೂ ಒಬ್ಬನೆ ಎಂಬ ಸತ್ಯವನ್ನು ಸರ್ವಮಾನವಾಳಿಗೆ ತಿಳಿಯಪಡಿಸುವುದು . 
    <br><br>
    2. ದೇವರ ಜ್ಞಾನವಾದ ಬ್ರಹ್ಮವಿದ್ಯಾಶಾಸ್ತ್ರ ಎಂದರೆ ದೈವಗ್ರಂಥಗಳಲ್ಲಿನ ಧರ್ಮಗಳನ್ನು ವಿಶ್ವವ್ಯಾಪ್ತವಾಗಿ ಪ್ರಚಾರ ಮಾಡುವುದು . 
    <br><br>
    3. ದೈವಜ್ಞಾನಿ , ತ್ರಿಕಾಲಜ್ಞಾನಿ , ಅಪರಬ್ರಹ್ಮ , ಬಹುಮುಖ ಪ್ರಜ್ಞಾಶಾಲಿ , ಮೂರು ಯೋಗಗಳು , ಮೂರು ಆತ್ಮಗಳ ಜ್ಞಾನ ತಿಳಿದ ಯೋಗೀಶ್ವರನು , ಆದಿ ( ದ್ರಾವಿಡ ) ಬ್ರಾಹ್ಮಣನು , ದ್ರಾವಿಡೇಶ್ವರನಾದ ರಾವಣ ಬ್ರಹ್ಮ ದೊಡ್ಡತನವನ್ನು ಸಮಾಜಕ್ಕೆ ತಿಳಿಸುವುದು . 
    <br><br>
    4. ತ್ರಿಕಾಲಜ್ಞಾನಿ , ಆಪರಬ್ರಹ್ಮ ಶ್ರೀ ರಾವಣಬ್ರಹ್ಮ ಮೇಲೆ ಇಲ್ಲಿಯವರೆಗೂ ಇರುವ ಕೆಟ್ಟ ಪ್ರಚಾರವನ್ನು ಹಿಂದಿರುಗಿಸುವುದು . 
    <br><br>
    5. ದ್ರಾವಿಡ ಎಂಬ ಪದದಲ್ಲಿ ತೈತ ಸಿದ್ಧಾಂತವಾದ ಮೂರು ಆತ್ಮಗಳ ವಿವರ ಇದೆಯೆಂದು ದ್ರಾ , ವಿ , ಡ ಎಂಬ ಅಕ್ಷರಗಳು ಪರಮಾತ್ಮ , ಆತ್ಮ ಮತ್ತು ಜೀವಾತ್ಮನನ್ನು ಸೂಚಿಸುತ್ತಿದೆಂದು ತಿಳಿಸುವುದು . 
    <br><br>
    6. ದ್ರಾವಿಡ ಎಂಬ ಪದಕ್ಕೆ ನಿಜ ಅರ್ಥವನ್ನು ತಿಳಿಸಿ . ಕ್ಷೀಣಿಸಿದ ದ್ರಾವಿಡರ ಪೂರ್ವವೈಭವವನ್ನು ಮನರುದ್ಧರಿಸುವುದು . 
    <br><br>
    7 . ಬ್ರಹ್ಮ ಜ್ಞಾನ ಇರುವವರೇ ನಿಜವಾದ ಬ್ರಾಹ್ಮಣರು ಅನ್ನುವ ಸತ್ಯವನ್ನು ಸಮಾಜಕ್ಕೆ ತಿಳಿಸುವುದು . 
    <br><br>
    8 . ಬ್ರಹ್ಮ ವಿದ್ಯಾ ಶಾಸ್ತ್ರದಲ್ಲಿನ ದೈವಜ್ಞಾನ ಆಧಾರವಾಗಿ ಎಲ್ಲಾ ಮತದವರನ್ನು ಸಮನ್ವಯಪಡಿಸುವುದು . 
    <br><br>
    9. ದೇವರಿಗು , ಭಗವಂತನಿಗು ಇರುವ ವ್ಯತ್ಯಾಸವನ್ನು ತಿಳಿಸುವುದು , 
    <br><br>
    10 , ದೇವರು ಮನುಷ್ಯ ( ಭಗವಂತ ) ನಾಗಿ ಬರಬಹುದಾಗಲಿ ಮನುಷ್ಯ ಮೋಕ್ಷ ಹೊಂದದವರೆಗು ದೇವರು ಆಗಲಾರನು ಸಮಾಜಕ್ಕೆ ಅರ್ಥಮಾಡಿಸುವುದು . 
    <br><br>
    11 . ಬ್ರಹ್ಮ ವಿದ್ಯಾ ಶಾಸ್ತ್ರದಲ್ಲಿನ ವಾಕ್ಯಗಳಿಗೆ ದೇವರ ವಿಧಾನದಲ್ಲಿನ ಭಾವವನ್ನು ವಿಶದೀಕರಿಸಿ ಹೇಳುವುದು . 
    <br><br>
    12. ಬ್ರಹ್ಮವಿದ್ಯಾ ಶಾಸ್ತ್ರ ಅಧ್ಯಯನ , ಆಚರಣೆ ಕರ್ಮಕ್ಷೇಪಕ್ಕೆ ಇವೆಯೆಂದು ತಿಳಿಸುವುದು . 
    <br><br>
    13. ಮತ್ತೆ ವೇದಗಳು , ಪುರಾಣಗಳು , ಇತಿಹಾಸಗಳ ಪಠಣ ಕಾಲಕ್ಷೇಪಕ್ಕೆ ಇದೆಯೆಂದು ತಿಳಿಸುವುದು , 
    <br><br>
    14. ಬ್ರಹ್ಮವಿದ್ಯಾ ಶಾಸ್ತ್ರದಲ್ಲಿ ಧರ್ಮಗಳು ದೈವಧರ್ಮಗಳೆಂದು , ಅವು ಪ್ರತಿ ಮನುಷ್ಯನಿಗು ಸಂಬಂಧಿಸಿರುವವೆಂದು , ಆಚರಣೆಗೆ ಎಷ್ಟೋ ಸುಲಭವಾದವೆಂದು ತಿಳಿಸುವುದು . 
    <br><br>
    15. ಅಧರ್ಮಗಳು ನಾಲ್ಕು ಎಂದು , ಮೂರು ಮಾತ್ರವೇ ಧರ್ಮಗಳು ಎಂದು , ಧರ್ಮಾಚರಣೆ ಮುಕ್ತಿಗೆ ಮಾರ್ಗವೆಂದು ಅದೇ ಮಾನವನ ಮುಖ್ಯ ಉದ್ದೇಶ ಆಗಬೇಕೆಂದು ತಿಳಿಸುವುದು . ( ಭಗವದ್ಗೀತ ವಿಶ್ವರೂಪ ಸಂದರ್ಶ ಯೋಗ 48 , 53 ಶ್ಲೋಕಗಳು ) 
    <br><br>
    16. ಮಾನವ ಜನ್ಮವೊಂದರ ಪ್ರಧಾನ್ಯತೆಯನ್ನು ತಿಳಿಸಿ , ತಾನು ಸೇರಬೇಕಾದ ಕೊನೆಯ ಗಮ್ಯ ಮೋಕ್ಷವೇ ಎಂದು , ಮೋಕ್ಷಮಾರ್ಗದಲ್ಲಿ ನಡೆದಾಗಲೇ ಮಾನವ ಜನ್ಮ ಉತ್ಕೃಷ್ಟವಾದ ಜನ ಆಗುತ್ತದೆಂದು ತಿಳಿಸುವುದು . 
    <br><br>
    17. ಮೂರು ಭಾಗಗಳಾಗಿ ಇರುವ ದೈವಗ್ರಂಥಗಳಲ್ಲಿನ ಜ್ಞಾನ ವಿಷಯಗಳನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ತಿಳಿದವರೆ ನಿಜವಾದ ಆತ್ಮಜ್ಞಾನಿ ಆಗುತ್ತಾನೆಂದು ಸಮಾಜಕ್ಕೆ ತಿಳಿಸುವುದು . 
    <br><br>
    18. ಬ್ರಹ್ಮ ವಿದ್ಯಾ ಶಾಸ್ತ್ರವನ್ನು ಪ್ರಪಂಚದಲ್ಲಿನ ಯಾವ ಪುಸ್ತಕಗಳ ( ವೇದಗಳು , ಮರಾಣಗಳು , ಉಪನಿಷತ್ತಗಳ ) ಹೊಂದಿಗೆ ಸರಿಹೋಲಿಸದಂತೆ ನೋಡುವುದು , 
    <br><br>
    19. ಬ್ರಹ್ಮವಿದ್ಯಾ ಶಾಸ್ತ್ರದಲ್ಲಿನ ಎದುರಾಡದ ಮತ್ತು ಪ್ರಶ್ನೆ ಉಳಿಯದ ದೈವಜ್ಞಾನವನ್ನು ಸಮಾಜಕ್ಕೆ ನೀಡಿ , ಎಲ್ಲರೂ ಬ್ರಾಹ್ಮಣತ್ವವನ್ನು ಹೊಂದುವಂತೆ ಮಾಡುವುದು . 
    <br><br>
    20 . ) . ಬ್ರಹ್ಮ ಎಂದರೆ ದೊಡ್ಡದು ಎಂದು , ಬ್ರಾಹ್ಮಣ ಅಂದರೆ ದೊಡ್ಡವನು ಎಂದು ಚಿಕ್ಕವನನ್ನು ದೊಡ್ಡವನನ್ನಾಗಿ ಮಾಡುವುದೇ ಧೈಯವಾಗಿ ಹೊಂದಿರುವುದು . 
   <br><br>
   ಇಗೆ
   <br><br>
    <h1>ರಾವಣಬ್ರಹ್ಮ ದ್ರಾವಿಡ ಬ್ರಾಹ್ಮಣ ಸಂಘ</h1>
    
     
    `
  }, 
  { 
    text:` 
    <ion-row>
    <ion-col class="ion-text-center">
    <h1>Ravana Brahma Temples</h1>
    </ion-col>
    </ion-row>
    `
    },
    {
      text: ``
    },
    {
      text: ``
    },
    {
      text: ` 
    <ion-row>
    <ion-col class="ion-text-center">
    <h1>ರಾವಣ ಬ್ರಹ್ಮ ಕುರಿತು  ಬಗ್ಗೆ ಗ್ರಂಥಗಳು</h1>
    </ion-col>
    </ion-row>
    <ion-row>
      <ion-col class="ion-text-center">
      <img  width="100%" src="assets/img/kannada/1.jpg" />  
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <ion-button fill="outline" shape="round"><a href="https://www.ravanabrahmadravidabrahmanasangham.org/bookpdf/Kan_26_DhravidaBrahmana.pdf">ಗ್ರಂಥವನ್ನು ತೆರೆಯಿರಿ</a> </ion-button>
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <img  width="100%" src="assets/img/kannada/2.jpg" />  
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <ion-button fill="outline" shape="round"><a href="https://www.ravanabrahmadravidabrahmanasangham.org/bookpdf/Kan_21_ThraithakaraRahasyam.pdf">ಗ್ರಂಥವನ್ನು ತೆರೆಯಿರಿ</a> </ion-button>
      </ion-col>
      </ion-row>
       
    `
    }    

]
}
