import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class TeluguGlobalService {
  public menu:any=[
    { title: "రావణ బ్రహ్మ", itemNumber:0,pathName:"telugu-content",chapterNumber: 0, subs:null , icon: 'information', language:'telugu' },
    { title: "సంఘం ఉద్దేశ్యములు", itemNumber:1,pathName:"telugu-aims",chapterNumber: 0, subs:null , icon: 'information', language:'telugu' },
    { title: "రావణబ్రహ్మ దేవాలయాలు", itemNumber:2,pathName:"telugu-temples",chapterNumber: 0, subs:null , icon: 'information', language:'telugu' },
    { title: "వీడియోలు", itemNumber:3,pathName:"videos",chapterNumber: 0, subs:null , icon: 'camera', language:'telugu' },
    { title: "పాటలు", itemNumber:4,pathName:"songs",chapterNumber: 0, subs:null , icon: 'camera', language:'telugu' },
    { title: "గ్రంథములు", itemNumber:5,pathName:"telugu-books",chapterNumber: 0, subs:null , icon: 'book-outline', language:'telugu' },
    { title: "అచ్చు మీడియా", itemNumber:5,pathName:"print-media",chapterNumber: 0, subs:null , icon: 'information', language:'telugu' },
    //{ title: "ప్రశ్న జవాబులు", itemNumber:5,pathName:"question-answer",chapterNumber: 0, subs:null , icon: 'information', language:'telugu' },

  ];
  constructor() { }
  menuContent:any=[
    {
      text: `
      <ion-row>
              <ion-col class="ion-text-center" style="color:maroon;">
                <h1>ద్రావిడ బ్రాహ్మణ రావణ బ్రహ్మ</h1><br>
              </ion-col>
            </ion-row>
            <p>
      ద్రావిడ బ్రాహ్మణ రావణబ్రహ్మ ఆది (ద్రావిడ) బ్రాహ్మణుడు, దైవజ్ఞాని, త్రికాలజ్ఞాని, అపరబ్రహ్మ, త్రిగుణాతీతుడు,
                మూడు యోగములు, మూడు ఆత్మల జ్ఞానము తెలిసిన యోగీశ్వరుడు, ద్రావిడేశ్వరుడు, మహామేధావి, భగవంతుడు అయిన రావణబ్రహ్మ
                విశ్రావశుడు మరియు కైకసి ల ప్రథమ సంతానముగా శ్రీలంక రాజ్యములో త్రైత యోగము (త్రేతాయుగముల) లో జన్మించాడు.
                <br><br>
                రావణబ్రహ్మ ఒక సాధారణ వ్యక్తికాదు, మహాశక్తి, దైవశక్తి. రావణబ్రహ్మ జన్మ రహస్యమైనది. శ్రీలంకకు చుట్టూ ఉన్న
                ఇందూ మహాసముద్రములో ఆ దైవశక్తి ఉన్నది. ఆ దైవశక్తి భూమిమీద దైవజ్ఞానమంటే ఏమిటో? యోగమంటే ఏమిటో? చివరకు మోక్షమంటే
                ఏమిటో? ఒక నమూనాను చూపవలెనని అనుకొన్నది. భూమిమీద ప్రజలకు జ్ఞానము, యోగము, మోక్షములకు తార్కాణముగా ఒక వ్యక్తిని
                పుట్టించి అతనిని చూచుట ద్వారా అందరికీ ప్రత్యక్ష ప్రమాణమును చూపునట్లు అగునని తలచిన దైవశక్తి తానే స్వయముగా ఒక
                తల్లిగర్భము నుండి పుట్టి రావణబ్రహ్మ అని పేరుగాంచినది. అంతేకాని ఆయన జననములో తల్లితండ్రుల ప్రమేయము లేదు.
                బ్రహ్మగా పిలువబడిన శక్తి నిజ జీవితములో జ్ఞానమును, యోగమును రావణుని నుండి చూపింది. చివరిలో బ్రహ్మవిద్యలో
                చెప్పిన మోక్షము పొందుటకు గల నియమముల ప్రకారము మరణించి మోక్షమును పొంది, ఈ విధముగానే ఏ మానవుడైనా మోక్షమును
                పొందాలి అని చూపించింది. దీనినిబట్టి రావణబ్రహ్మ అంటే సాధారణ వ్యక్తి కాదనీ ఆయన ఒక శక్తి అనీ జ్ఞాన, యోగ,
                మోక్షములను జీవితములో తార్కాణముగా చూపిన వ్యక్తిగా కనిపించిన శక్తియనీ అర్థమగుచున్నది.
                <br><br>
                "రావణ" ఆయన పేరుకాగా "బ్రహ్మ" అనునది ఆయన బిరుదు. ఆధ్యాత్మిక అర్థము ప్రకారము 'బ్రహ్మ' అనగా పెద్ద అను ఒకే ఒక
                అర్థము వచ్చును. దేవుడు తప్ప ఈ విశ్వములో పెద్ద ఎవరూ లేరు. కావున బ్రహ్మ అను పదము దేవునికి మారుపేరుగా
                చెప్పబడుచున్నది. రావణ అను పదము విభజించి చూస్తే ర + వణ అని రెండుగా చెప్పవచ్చును. "ర" అంటే నాశనమును
                సూచించునదనీ "వణ" అనగా అడవిలో వృక్షముల సముదాయమనీ అర్థము రాగలదు. రావణ పేరులో వణమును నాశనము చేయువాడను అర్థము
                వచ్చుచున్నది. మాయ అను అడవిలో, గుణములను వృక్షములను నాశనము చేయువాడు అను అర్థముతో రావణ పేరున్నదని
                తెలియుచున్నది. ఆ కాలములో మాయ అను అడవిని సమూలముగా నాశనము చేయుటలో అందరికంటే పెద్దవాడు అయిన దానివలన ఆయనకు
                రావణబ్రహ్మ అని పేరు పెట్టడము జరిగినది.
                <br><br>
                రావణబ్రహ్మ మహా మేధావి. బ్రహ్మవిద్యా శాస్త్రము, జ్యోతిష్యశాస్త్రము, రాజనీతి, ఆయుర్వేదము, సంగీతము... ఇలా ఎన్నో
                రంగాలలో 'మేధావి, బహుముఖ ప్రజ్ఞాశాలి' అని పేరొందారు. పది మేధావి తలలకు ఉన్న జ్ఞానశక్తి, తెలివితేటలు ఆయనలో
                కనిపించేవి కావున ఆయనను ఆనాటి జ్ఞాన పెద్దలు 'దశకంఠుడు' అని గౌరవముగా పిలిచెడివారు. అంతేకాని రావణునికి పది
                తలలున్నాయనుట పూర్తి అసత్యము. సూక్ష్మముగా దశకంఠుడే కానీ, భౌతికముగా అందరికున్నట్లు ఒక తల మాత్రమే ఉండెడిది.
                <br><br>
                త్రైతాయోగములో ఇందూ మహాసముద్రము దైవశక్తితో కూడుకున్నదని తెలిసిన ఒకే ఒక వ్యక్తి రావణబ్రహ్మ. అందువలన తరచూ ఆయన
                సముద్ర స్నానము చేసెడివారు. ఇందూ మహాసముద్రములో స్నానము చేయుట వలన దైవశక్తి వారి తలయందు చేరునని ఆనాడే
                రావణబ్రహ్మకు తెలుసు. ఆనాడు అంత శక్తి ఇందూ మహాసముద్రములో ఉండేది. అయితే ఈనాడు ఆ శక్తి అక్కడలేదు. త్రికాలజ్ఞాని
                అయిన రావణబ్రహ్మ ఆ సముద్రమునకు జ్ఞాన చిహ్నముగా"ఇందు"అని పేరుపెట్టి ఆయన చనిపోయన తర్వాత కూడా ఆయన ఆత్మశక్తిని,
                ఇందూ మహాసముద్రము లోనే ఉండునట్లు చేశారు. తర్వాత కాలములో దేశము పేరు మార్చి "హిందూ" చేసి, సముద్రము
                పేరును "హిందూ" చేయడంతో ఆ రావణబ్రహ్మ ఆత్మశక్తి ఈ సముద్రమునే వదలిపోయి నేడు అమెరికా దగ్గరున్న అట్లాంటిక్
                సముద్రములో చేరిపోయినది. ఆనాడు జీవాత్మ, ఆత్మ, పరమాత్మ అను త్రైత జ్ఞానమును తెలిసిన రావణబ్రహ్మ ఆత్మశక్తి అదే
                త్రైత సిద్ధాంతమునకు గుర్తుగా సముద్రమునందు మూడు కోణములశక్తిగా వ్యాపించి నేడు "బెర్ముడా ట్రయాంగిల్" గా
                పేరుగాంచింది. ఆయన జీవితము జననము నుండి మరణము దాకా బ్రహ్మవిద్యాశాస్త్ర ప్రామాణికముగానే నడచి, సర్వజీవరాశులకు
                మార్గదర్శకముగా నిలిచింది. ఆ దైవశక్తే, ఆత్మశక్తిగా, చైతన్యశక్తిగా, త్రైతాకారశక్తిగా ఫ్లోరిడా దగ్గర బెర్ముడా
                ట్రయాంగిల్ గా ఇప్పటికీ ఉన్నది. ఉత్తర అట్లాంటిక్ సముద్రమునందు ఒక చోటున్న ఈ శక్తి, భూమండలమంతా వ్యాపించి
                ప్రకృతి భాగములైన పంచభూతములకు చైతన్యమునిచ్చి ఎప్పుడు, ఎక్కడ, ఏ విధముగా వాటిని పని చేయించవలెనో, ఆ విధముగానే
                పని జరుగునట్లు చేయుచున్నది.
                <br><br>
                ఈశ్వరుడు అనగా అధిపతి. విశ్వమునకు అధిపతి అయిన నిరాకారుడైన పరబ్రహ్మ పురుషోత్తమునకు మారురూపమైన ఈశ్వరలింగమునే
                రావణబ్రహ్మ పూజించారు. సకల మానవజాతికి నిరాకార పరమాత్మను ఏ విధముగా పూజించాలో తెలియచేయు నిమిత్తము తాను
                ఈశ్వరలింగ ఆరాధన చేసి మనకు మార్గదర్శకంగా నిలిచారు. అంతేకాని తాను ఏనాడూ అన్యదేవతారాధన చేయలేదు సరికదా అటువంటి
                ఆరాధనలను ఖండించారు. యోగమును తప్ప తపస్సు చేసెడివాడు కాదు.
                <br><br>
                సురులు అనగా సురాపానము చేసేవారని, అసురులు అనగా సురాపానము చేయనివారని అర్థము. అందుకే రావణబ్రహ్మను ఎటువంటి చెడు
                అలవాటు లేనివాడని చెప్పుటకు ఆయనను రావణాసురుడు అని ఆనాటి జ్ఞానపెద్దలు సంబోధించేవారు. కానీ ఆయనతో శత్రుత్వము
                ఉన్న ఆర్యులు అసుర అన్న పదము యొక్క అర్ధము మార్చి అసుర అంటే రాక్షసుడు అని భాష్యము చెప్పారు. మిగతా మానవజాతి అదే
                నిజమని నమ్మారు. ఉన్నత వంశములో పుట్టినటువంటి వ్యక్తి "రావణుడు", ఆయనను "పౌలస్యబ్రహ్మ" అని కూడా పిలుస్తారు. ఆయన
                బ్రహ్మత్వాన్ని ఎరిగిన అసలైన ద్రావిడ బ్రహ్మణుడు. ఆయన రాక్షసుడు ఎలా అయ్యాడు?
                <br><br>
                రావణబ్రహ్మతో ఆర్యుల శత్రుత్వమునకు ముఖ్యకారణమేమనగా! ఆర్యులు ప్రోత్సాహించిన 4 అధర్మాలను (యజ్ఞాచరణ, మంత్రపఠనము,
                తపస్సులు, దానములు) ద్రావిడేశ్వరుడు ఖండించెడివారు. వాటి ఆచరణను ఆటంకపరచేవారు. మూడు ధర్మములైన బ్రహ్మయోగము,
                కర్మయోగము, భక్తియోగములను ప్రోత్సాహించెడివారు. బ్రహ్మవిద్యాశాస్త్రము ప్రకారము పైన చెప్పిన 4 అధర్మాలు
                దైవమార్గము అనగా మోక్ష మార్గమునకు వ్యతిరేఖమనీ, మూడు ధర్మముల ఆచరణే మోక్షమునకు మార్గమనీ తెలిపిన రావణబ్రహ్మ
                అధర్మములను ఖండించుటచే అది గిట్టని ఆర్యులు ఆయనపై దుష్ప్రచారము చేసెడివారు. అధర్మములైన యజ్ఞయాగాదులను, వేదముల
                అధ్యయనమును, తపస్సు, దానములను ప్రవేశపెట్టి, దైవజ్ఞానము కలుషితము చేయాలని చూసిన ఆర్యుల ప్రయత్నమును ఎదిరించి ఇవి
                అధర్మములు అని చెప్పడము వలన, ఈయన ధర్మములగాని అయిన జ్ఞానకలుషితమును తీసివేయుటకు వచ్చిన భగవంతుడని తెలియవచ్చును.
                <br><br>
                'బ్రహ్మజ్ఞానము కలవారిని బ్రాహ్మణులు అనాలి.' బ్రహ్మజ్ఞానముబట్టి ఏ మనిషి అయినా బ్రాహ్మణుడు అని పిలువబడతాడుగానీ
                కులములో బ్రాహ్మణకులము అనునది లేనేలేదు. మూడు ఆత్మల జ్ఞానము తెలిసినవారు ఎవరైనా ఉంటే వారిని ద్రావిడ బ్రాహ్మణులు
                అని చెప్పవచ్చును. వేదముల, యజ్ఞముల జ్ఞానము తెలిసినవారెవరైనా ఉంటే వారిని ఆర్యబ్రాహ్మణులు అని చెప్పవచ్చు.
                సంపూర్ణజ్ఞాని అయిన రావణబ్రహ్మ స్వచ్ఛమైన బ్రాహ్మణుడు. దేశమునకు రాజయిన దానివలన ద్రావిడ బ్రాహ్మణులందరికీ
                నాయకుడుగాయుండి బ్రాహ్మణులలో దైవభక్తి, జ్ఞానశక్తి తగ్గకుండా చూచుకొనెడివారు. ద్రావిడ బ్రాహ్మణుడు ఎవడుగానీ
                అజ్ఞానములోనికి పోకుండా, మూడు ఆత్మల జ్ఞానములో ఉండేలా, ఎంతో జ్ఞానశక్తికి నిలయమైయుండునట్లు రావణుడు
                పర్యవేక్షించేవాడు. శ్రీలంకలో ఉన్నవారికి రోగములు సహితము భయపడెడివి. ఏ రోగముకానీ లంక దరిదాపులకు పోయేది కాదు.
                త్రైతయోగములో వచ్చిన దైవాంశ అయిన రావణబ్రహ్మ తన బుద్ధిబలమును మంత్రశక్తిగా మార్చి పుష్పక విమానమును తయారు చేసి
                దానియందు వివిధ ప్రాంతాలకు ప్రయాణించి బ్రహ్మజ్ఞానమును అందరికీ అందించాడు.
                <br><br>
                ఈ విధముగా దక్షిణ భారతదేశమంతా రావణబ్రహ్మ ఆధీనములో ఉండి, ప్రతి ఒక్కరూ జ్ఞానవంతముగా నడుచుకొనేవారు. ఎవరైనా
                కోర్కెల నిమిత్తము యజ్ఞములు చేసినప్పుడు రావణబ్రహ్మ అనుచరులువచ్చి భంగము చేయగా, ఆ యజ్ఞములకధిపతులుగా యున్న
                గ్రహశక్తులు రావణబ్రహ్మ అనుచరులను ఏమాత్రము అడ్డుకోక వారికే మద్దతు తెలిపెడివి. ఆర్యుల ప్రోద్భలముతో ఎవరైనా
                అటువంటి అధర్మ ఆరాధనలు చేస్తే వారిని రావణ బ్రహ్మ, ఆయన సైన్యము అడ్డుకోవడము జరిగేది. లంకేశ్వరుడు ఆర్యుల పాలిట
                యమునివలె కనిపించాడు. దక్షిణ భారతదేశమున ఆర్యులు, తమ ఆర్య ప్రాభవమును పెంపొందించుటకు యజ్ఞయాగాదులు, వేద
                అధ్యయనములు ఎక్కువగా చేయుచుండిరి. ఆ క్రమములో యాగరక్షణకు రాముడిని విశ్వామిత్రుడు తీసుకువెళ్ళడము జరిగినది.
                చిన్నవయస్సులో ఎటువంటి బ్రహ్మజ్ఞానము లేని రాముడు యజ్ఞరక్షణకు వెళ్ళి, అధర్మాన్ని అడ్డుకొన్న రావణుని అనుచరులను
                అన్యాయముగా చంపడము జరిగింది. రాముడు పుట్టక పూర్వము నుండే ఉన్న ఆర్యుల, ద్రావిడుల వైరము ఈ సంఘటనతో ఇంకా
                తీవ్రతరము అయినది. ఇవి చరిత్రకెక్కని వాస్తవాలు.
                <br><br>
                రామాయణ చరిత్రను గ్రంథరూపముగా వ్రాసిన ఆర్యుడైన వాల్మీకి రావణబ్రహ్మను దుర్మార్గుడు, కామాంధుడు అని వ్రాయడము
                జరిగెనది. ఆ దినము రావణుడు సీతను తీసుకుపోయినది వాస్తవమే అయినా, ఆయన ఏ ఉద్దేశ్యముతో తీసుకుపోయాడో తెలియకుండా
                మాట్లాడితే మనకు విచక్షణ లేనట్లే. ఇచ్ఛామరణము వున్న రావణబ్రహ్మ, రాముని చేతిలో తన చావు ఉన్నదని, అలా జరుగుటకు
                సీతను లంకకు తీసుకురావలెనను విషయమును తన భార్య మండోదరి దేవికి ముందే చెప్పాడు. ఆ విషయములు ప్రక్కనబెట్టి సీతను
                దురుద్దేశ్యముతో రావణుడు లంకకు తీసుకువెళ్ళాడని ఆర్యులు చెడు ప్రచారము చేసి వ్రాశారు. 80 సం || పైబడిన
                వృద్ధాప్యములో ఉన్న రావణుడు ఎంతో అనుభవశాలి, మేధావి అయినందున దాదాపు రెండు పదుల సంఖ్యలో స్త్రీలను సీతకు
                పరిచర్యలు చేయుటకు తోడుగాయుండుటకు ఏర్పాటు చేసి మంచి వాతావరణము కొరకు సీతను తన నివాసమునకు 50 కి.మీ దూరములో గల
                ఉద్యానవనములో ఉంచాడు. వారమునకు ఒకమారు భార్యాసమేతుడై అశోకవనమునకు పోయి ఒక తండ్రివలె పలుకరించి సీత ఆరోగ్య
                విషయములు తెలుసుకొని ఆమెకు ఏ కొరతా లేనట్లు చూడమని తనవారికి చెప్పి వచ్చెడి వాడు. సీతకు జరుగబోవు విషయములు ముందే
                చెప్పి, రాముడు తన కారణమున ఇక్కడికి రావలసివుందని, తన మరణము ఎప్పుడు జరుగునో కూడా ముందే సీతకు చెప్పాడు. రాముడు
                ఎటువంటి (ఎలాంటి) మనస్థత్వము కలవాడో జరుగబోవు కాలములో నీకే తెలుస్తుందని కూడా సీతకు చెప్పాడు. సీత ఏనాడూ రావణుడు
                చెడ్డవాడని ఆరోపణ చేయలేదు. దాదాపు పదకొండు సంవత్సరములు వాల్మీకి ఆశ్రమములోనున్న సీత ఏ సౌకర్యములులేని కుటీరములో
                అనేక బాధలుపడి, పదినెలలు రావణుని కాలములో లంకలోయున్నప్పుడే ఏ కష్టము లేకుండా జరిగినట్లు ఎన్నోమార్లు అనుకొన్నది.
                సీత ఏనాడూ రావణుడు చెడ్డవాడని చెప్పకపోయినా, రామాయణము వ్రాసినవారు ఆర్యులైన దానివలన రావణబ్రహ్మను దుష్టునిగా
                చిత్రించి చూపారు. అంతేతప్ప వాస్తవానికి రావణుడు ఏ మచ్చాలేని జీవితమును గడిపిన బ్రహ్మజ్ఞాని. జరుగబోవు
                భవిష్యత్తు తెలిసిన కాలజ్ఞానికీ, యోగీశ్వరునికీ, ఇచ్ఛామరణము ఉ న్నవానికీ నీతి న్యాయము, జ్ఞానము ధర్మము తెలియవా?
                రావణబ్రహ్మ యొక్క గొప్పతనమును ఏమాత్రము గుర్తించక చివరికి ఆయనను ఒక అజ్ఞానిగా, దుర్మార్గునిగా, కామాంధుడిగా,
                రాక్షసునిగా నాడు ఆర్యకవులు ద్రావిడులపై గల ప్రాంతీయతత్వ బేధముతో రావణబ్రహ్మను చెడుగా చిత్రీకరించి వ్రాసి,
                ప్రచారము చేస్తే నేడు కూడా అందరూ అదే అంటున్నారు తప్ప తమ బుద్ధితో ఏమాత్రము ఇది నిజమా? అబద్ధమా? అని యోచించుట
                లేదు. పండితులు, పామరులు, బుద్ధివున్నవారు, బుద్ధిలేనివారు రావణబ్రహ్మను సాధారణ మనిషికంటే హీనముగా
                మాట్లాడుతున్నారు.
                <br><br>
                అందువలననే సముద్రములో ఉన్న ఆత్మశక్తి మనుషుల అజ్ఞానము మీద కోపముగలదై, ఇందూ సముద్రమునే వదలిపోయి, అమెరికా
                దగ్గరున్న అట్లాంటిక్ మహాసముద్రములో చేరిపోయి "బెర్ముడా ట్రయాంగిల్" గా పేరుగాంచి తన పరిసర ప్రాంతములోనికి పోయిన
                వారందరినీ ప్రమాదమునకు గురిచేయుచున్నది. కొందరిని దైవజ్ఞానము తెలుసుకొనుటకు ఇతర గ్రహముల మీదికి పంపుచున్నది.
                జ్ఞానము తెలిసినవారిని, ఏమీ చేయక, ఆటంకము లేకుండా ప్రయాణించడానికి సహకరిస్తున్నది. దేవుని పాలనలో ముఖ్యపాత్ర
                వహిస్తున్న మేఘములు ఈ త్రైతాకార శక్తిని తాకి శక్తిని పొంది వస్తున్నవి. త్రైతాకారశక్తిని తాకి పూర్తిగా
                ఉత్తేజమైన మేఘములు భూమీమీద గల జీవ రాశుల మీద తమ ప్రభావమును చూపుతున్నవి. ఈ దైవిక శక్తి యొక్క వివరము ఏ సైన్సూ
                ఇవ్వలేదు. ఒక్క సూపర్ సైన్స్ (బ్రహ్మవిద్యాశాస్త్రము) మాత్రమే ఇవ్వగలదు.
                <br><br>
                ఆనాడు లంకలోయున్న వారందరూ దైవజ్ఞానము తెలిసినవారేగానీ రాక్షస స్వభావము కల్గినవారు లేరు. అక్కడి వారందరు
                జ్ఞానులైయున్నందున ఆ దేశమునకు "శ్రీ" అను శుభకరమైన అక్షరము చేర్చి "శ్రీలంక" అని పిలవబడుచున్నది. శ్రీ అనగా
                మోక్షము అని అర్థము. ఇప్పటికీ శ్రీలంకలో రావణబ్రహ్మ కాలంనాటి, ఆయన రాజ్యములో పౌరులుగా నివసించినవారి వంశస్తులు
                ఉన్నారు. వారు స్వచ్ఛమైన తెలుగు భాషనే యాసగా మాట్లాడు తున్నారు. వారు సంచారజాతులుగా శ్రీలంకలో
                పరిగణించబడుతున్నారు కానీ ఇది నగ్న సత్యము. ద్రావిడజాతి వాడైన రావణబ్రహ్మ కాలమునాడే రావణుడు సైతము తెలుగు భాషనే
                మాట్లాడేవాడని ఈనాటికీ వారు చెప్తున్నారు. కాబట్టి వక్రీకరించిన రావణుని చరిత్రను ఇప్పటికైనా నిష్పక్షపాతముగా
                పరిశోధన చేస్తే రావణుడు ఎంత ఉన్నతమైన వ్యక్తియో, తెలుగు భాష ఎంతటి ప్రాచీనమైన భాషయో నిరూపించబడుతుంది.
                శ్రీలంకలోని సంచార జాతులుగా పరిగణించబడే తెలుగువారు రావణబ్రహ్మను ఈనాటికీ ఆరాధిస్తున్నారు. ఆయనను రాక్షసుడుగా
                వారు ఒప్పుకోవడములేదు, మేము కూడా వారితో ఏకీభవిస్తున్నాము. సృష్ఠి ఆదిలో పరమాత్మ సూర్యునికి జ్ఞానాన్ని
                బోధించాడు. అది సూర్యుని ద్వారా మనువుకు, మనువు ద్వారా సమస్త లోకాలకు తెలియ చేయబడినది. అట్టి జ్ఞానాన్ని
                సంపూర్ణముగా ఆచరించిన వ్యక్తి రావణబ్రహ్మ మాత్రమే. దీనిని సహించలేని ఆసీయులు (ఆర్యులు) ఆయనను రాక్షసునిగా
                పరిగణించారు. రావణబ్రహ్మ ధర్మవరునిగా, ధర్మయుద్ధము చేసిన వ్యక్తిగా రావణబ్రహ్మను అభిమానించు తెలుగుజాతివారు ఈ
                నాటికీ శ్రీలంకలో ఉన్నారు. ఆయన మరణించలేదనీ, గాయపడినాడనీ తిరిగి సజీవముగా ఏనాటికైనా వస్తారనీ విశ్వసిస్తున్నారు.
                రామ, రావణయుద్ధములో వానరులు కానీ, భల్లూకములు కానీ ఇతరత్రా ఏ జంతువులు కానీ యుద్ధము చేయలేదనీ, చరిత్రను
                వక్రీకరించి వ్రాశారనీ, ఇదంతా ఆసీయులు చేసిన కుట్ర అని వారివద్ద ఆధారములు ఉన్నట్లు వారు చెపుతున్నారు. పూర్వము
                భారతావనిని మొత్తము ద్రావిడ జాతిగానే పరిగణించేవారనీ కొన్ని చారిత్రక ఆధారముల వల్ల నిరూపితమవుతోంది. కాలక్రమేణా
                ఆసీయులు అనబడే ఆర్యులు బ్రతుకుతెరువుకై భారతదేశానికి వలస రావడము జరిగింది. అట్లు బ్రతుకుతెరువుకు వలస వచ్చిన
                ఆసీయులే దేవుని ధర్మాలకు, జ్ఞానానికి దగ్గరగా వున్న ద్రావిడులను వంచనతో, దౌర్జన్యముతో ఆక్రమణ చేసుకోవడము
                జరిగింది. వారే ఈనాడు ఆర్యులుగా పిలువబడుతున్న వారు. ఆర్యులు యొక్క రాక వల్ల అమాయకులైన ద్రావిడులు తమ
                స్వయంప్రతిపత్తిని కోల్పోయి, దైవజ్ఞానానికి దూరమై ఆసీయుల కుతంత్రాలకు బలియై, అధర్మాలను ద్రావిడులపై రుద్దడము
                జరిగినది. అందువలన క్రమక్రమంగా ద్రావిడులు తమ ఉనికిని కోల్పోయి, ద్రావిడులమనే స్పృహ కోల్పోయే స్థితికి
                చేరుకున్నారు.
                <br><br>
                ద్రావిడ దేశములో అంతర్భాగమైన శ్రీలంకలో రావణబ్రహ్మ పాలనలోని ప్రజలుగా పిలువబడుతున్న వారు ఈనాటికీ.... ఏనాటికైనా
                రావణబ్రహ్మ తిరిగివస్తాడు, ఆయనకు మరణము లేదు, ఆయన ఏనాటికైనా తిరిగి వచ్చి ధర్మాన్ని స్థాపిస్తాడని
                విశ్వసిస్తున్నారు. మేము చెప్పేది కూడా అదే.... ఆత్మశక్తిగా త్రైతాకార శక్తిగా (బెర్ముడా ట్రయాంగిల్) ఉన్న ఆయన,
                ధర్మాలు పునరుద్ధరించుటకు మళ్ళీ అవతరిస్తాడు అనీ, ఆయన జీవుడు కాదు ఆయనకు మరణములేదనీ కాబట్టి మరుగున పడిపోయిన
                సత్యమును బయటికి తీసి రావణబ్రహ్మ అజ్ఞానికాదు సంపూర్ణ దైవజ్ఞాని అనియూ, ఆయన దుర్మార్గుడు కాదు సన్మార్గుడు
                అనియూ, ఆయన శూద్రుడు కాదు నిజమైన సద్ర్భాహ్మణుడు అనియూ, ఆయన సామ్యానుడు కాదు దైవధర్మాలు పునరుద్ధరించుటకు
                అవతరించిన యోగీశ్వరుడు, భగవంతుడు అనియూ తెలియ చేయాలనుకొన్నాము, తెలియ చేస్తున్నాము.
                <br><br>
                <h1>రావణబ్రహ్మ ద్రావిడ బ్రాహ్మణ సంఘము</h1>
                </p>
      `
    },{
      text:`
      <ion-row>
        <ion-col class="ion-text-center">
        <h1><b>సంఘం ముఖ్య ఉద్దేశాలు</h1></b>
        </ion-col>
      </ion-row>
             <br>
      1. "విశ్వ సృష్టికర్త అయిన దేవుడు అందరికీ ఒక్కడే" అనే సత్యాన్ని సర్వమానవాళికి తెలియపరచుట.
      <br><br>
      2. దేవుని జ్ఞానమైన బ్రహ్మవిద్యా శాస్త్రము అనగా దైవ గ్రంథములలోని ధర్మములను విశ్వ వ్యాప్తంగా ప్రచారం చేయుట.
      <br><br>
      3. దైవజ్ఞాని, త్రికాలజ్ఞాని, అపరబ్రహ్మ, బహుముఖప్రజ్ఞాశాలి, మూడు యోగములు, మూడు ఆత్మల జ్ఞానము తెలిసిన యోగీశ్వరుడు, ఆది (ద్రావిడ) బ్రాహ్మణుడు, ద్రావిడేశ్వరుడు అయిన రావణబ్రహ్మ గొప్పతనాన్ని సమాజానికి తెలియజేయుట.
      <br><br>
      4. త్రికాలజ్ఞాని, అపరబ్రహ్మ శ్రీ రావణబ్రహ్మ పై ఇప్పటి వరకు గల చెడు ప్రచారమును త్రిప్పి కొట్టుట.
      <br><br>
      5. ద్రావిడ అను పదము లో త్రైత సిద్ధాంతమైన మూడు ఆత్మల వివరం ఉన్నదని ద్రా, వి, డ అను అక్షరములు పరమాత్మ, ఆత్మ మరియు జీవాత్మ లను సూచించుచున్నవి అని తెలియజేయుట.
      <br><br>
      6. ద్రావిడ అను పదమునకు నిజ అర్ధమును తెలియజేసి, క్షీణించిన ద్రావిడుల పూర్వ వైభవమును పునరుజ్జీవింప చేయుట.
      <br><br>
      7. బ్రహ్మజ్ఞానము కలవారే నిజమైన బ్రాహ్మణులు అను సత్యమును సమాజానికి తెలియజేయుట.
      <br><br>
      8. బ్రహ్మ విద్యా శాస్త్రములోని దైవజ్ఞాన ఆధారముగా అన్ని మతముల వారిని సమన్వయ పరచుట.
      <br><br>
      9. దేవుడికి, భగవంతుడికి గల తేడాను తెలియజేయుట.
      <br><br>
      10. దేవుడు మనిషి (భగవంతుడు) గా రావచ్చు కానీ, మనిషి మోక్షము పొందనంత వరకు దేవుడు కాలేడని సమాజమునకు అర్థం కావించుట.
      <br><br>
      11. బ్రహ్మ విద్యా శాస్త్రములోని వాక్యములకు దేవుని విధానములోని భావమును విశదీకరించి చెప్పడము.
      <br><br>
      12. బ్రహ్మ విద్యా శాస్త్ర అధ్యయనం, ఆచరణ కర్మక్షేపము నకు ఉన్నవని తెలియజేయుట.
      <br><br>
      13. వేదాల, పురాణాల, ఇతిహాసాల పఠనము కాలక్షేపమునకు ఉన్నవని తెలియజేయుట.
      <br><br>
      14. బ్రహ్మ విద్యా శాస్త్రములోని ధర్మములు దైవధర్మములనీ, అవి ప్రతి మనిషికీ సంబంధించినవనీ, ఆచరణకు ఎంతో సులువైనవనీ తెలియజేయుట.
      <br><br>
      15. అధర్మములు నాలుగు అనీ, మూడు మాత్రమే ధర్మములు అనీ, ధర్మాచరణే ముక్తికి మార్గమని... అదే మానవుని ముఖ్య ఉద్దేశం కావాలని తెలియజేయుట. (భగవద్గీత విశ్వరూప సందర్శన యోగము 48, 53 శ్లోకములు)
      <br><br>
      16. మానవ జన్మ యొక్క ప్రాధాన్యతను తెలియజేసి, తాను చేరవలసిన చివరి గమ్యము మోక్షమేనని, మోక్షమార్గమున నడచినప్పుడే మానవ జన్మ ఉత్కృష్టమైన జన్మ అగునని తెలియజేయుట.
      <br><br>
      17. మూడు భాగములుగా ఉన్న దైవ గ్రంథములలోని జ్ఞాన విషయములను సంపూర్ణంగా తెలిసిన వారే నిజమైన ఆత్మజ్ఞాని కాగలరని సమాజానికి తెలియజేయుట.
      <br><br>
      18. బ్రహ్మవిద్యా శాస్త్రమును ప్రపంచంలోని ఏ పుస్తకముల (వేదాలు, పురాణాలు, ఉపనిషత్తులు) తోనూ సరి పోల్చకుండా చూచుట.
      <br><br>
      19. బ్రహ్మ విద్యా శాస్త్రములోని ఎదురాడని మరియు ప్రశ్నే మిగలని దైవ జ్ఞానమును సమాజమునకు అందించి, అందరూ బ్రాహ్మణత్వమును పొందునట్లు చేయుట.
      <br><br>
      20. బ్రహ్మ అంటే పెద్ద అనీ, బ్రాహ్మణుడు అంటే పెద్దవాడు అనీ, చిన్నవాడిని పెద్దవాడిగా చేయుటయే ధ్యేయముగా కలిగి ఉండుట.
      `
    }, 
    { 
      text:` 
      <ion-row>
      <ion-col class="ion-text-center">
      <h1>రావణ బ్రహ్మ దేవాలయములు</h1>
      </ion-col>
      </ion-row>
      `
      },
      {
        text: ``
      },
      {
        text: ``
      },
      {
        text: ` 
     
      `
      },
      {
        text: ``
      },    
  ]
  
  

}
