import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class HindiGlobalService {

  constructor() { }
  public menu:any=[ 
    { title: "रावणा ब्रम्हा", itemNumber: 0,pathName:"hindi-content",chapterNumber: 0, subs:null , icon: 'information', language:'hindi' },
    { title: "संघ के उद्देश्य", itemNumber: 1,pathName:"hindi-aims",chapterNumber: 0, subs:null , icon: 'information', language:'hindi' },
    { title: "रावणब्रह्म मंदिर", itemNumber: 2,pathName:"hindi-temples",chapterNumber: 0, subs:null , icon: 'information', language:'hindi' },
    { title: "वीडियो", itemNumber: 3,pathName:"videos",chapterNumber: 0, subs:null , icon: 'camera', language:'hindi' },
    { title: "गीत", itemNumber: 4,pathName:"songs",chapterNumber: 0, subs:null , icon: 'camera', language:'hindi' },
    { title: "ग्रंथों", itemNumber:5,pathName:"hindi-books",chapterNumber: 0, subs:null , icon: 'book-outline', language:'hindi' },
    { title: "प्रिंट मीडिया", itemNumber:6,pathName:"print-media",chapterNumber: 0, subs:null , icon: 'information', language:'hindi' },
   // { title: "प्रश्न जवाब", itemNumber:5,pathName:"question-answer",chapterNumber: 0, subs:null , icon: 'information', language:'hindi' },


  ];
  menuContent:any=[
    {
      text: `
  <ion-row>
  <ion-col class="ion-text-center" style="color:maroon;">
    <h1>द्राविड़ ब्राम्हण रावण ब्रम्हा </h1><br>
  </ion-col>
</ion-row>
<p>

रावणब्रम्हा आदि ( द्राविड़ ) ब्राम्हण , दैव ( परमात्म ) ज्ञानी , त्रिकालज्ञानी , अपर ब्रम्हा , तीन योगों , तीन आत्माओं के ज्ञान के ज्ञाता योगिश्वर , द्राविड़ेश्वर , महा मेधावी , भगवान थे । रावणब्रम्हा , विश्रवशु तथा कैकसि के प्रथम संतान , श्री लंका राज्य में त्रैत योग ( त्रेता युग ) में उनका जन्म हुआ था ।  
<br><br>
रावणब्रम्हा कोई साधारण व्यक्ति नहीं थे , बल्कि रावणब्रम्हा का जन्म एक रहस्यमयी जन्म था | श्री लंका के चारों तरफ इन्दू महासागर में दैव ( परमात्म ) शक्ति विद्यमान थी । उस दैवशक्ति ने धरती पर दैवज्ञान का तात्पर्य क्या है ? योग क्या है ? मोक्ष क्या है ? एक नमूना प्रस्तुत करने का विचार किया । प्रजा जनों को ज्ञान , योग , मोक्ष को दृष्टान्त के रूप में एक व्यक्ति को पैदा करवाया , उस व्यक्ति को देख , सब को प्रत्यक्ष प्रमाण देखने का अभास हो सके सोचकर दैव शक्ति ने स्वयं ही एक माता के गर्भ से जन्म लिया । सब उन्हें रावणब्रम्हा के नाम से जानते हैं । इतना ही नहीं उनके जनन में माता - पिता असम्मिलित थें । इस प्रकार से रावणब्रम्हा के नाम से संबोधित हुई शक्ति निज जीवन में ज्ञान तथा योग को रावण के ज़रिये प्रस्तुत किया । अंततः ब्रम्हविद्या में कथित मोक्ष को प्राप्त करने के लिए नियमों के अनुसार मरण प्राप्त कर मोक्ष प्राप्त किया । इस प्रकार से कोई भी मानव मोक्ष को प्राप्त कर सकता है , करके दिखलाया । इससे स्पष्ट है कि रावणब्रम्हा कोई साधारण व्यक्ति नहीं थे बल्कि वे एक शक्ति   थे , जो ज्ञान , योग , तथा मोक्ष को जीवन में दृष्टान्त रूप में प्रस्तुत करनेवाले व्यक्ति के रूप में एक प्रत्यक्ष शक्ति थे । 
<br><br>
उनका नाम ' रावण ' था , ' ब्रम्हा ' उन्हें मिली उपाधि थी । आध्यात्मिक अर्थ के अनुसार ' ब्रम्हा ' का अर्थ बड़ा होता है । परमात्मा या ईश्वर के अलावा इस विश्व में बड़ा कोई नहीं है । इसलिए ब्रम्हा शब्द ईश्वर का दूसरा नाम कहा जाता रहा है । रावण शब्द को विभाजित करने पर रा + वण दो भाग हुए । ' रा ’ तात्पर्य नाश सूचित करता है , ' वण ' वृक्षों के समूह सूचित करता है । मायारूपी अरण्य में गुणरूपी वृक्षों को नष्ट करनेवाला । इस अर्थ के साथ रावण नाम पड़ना स्पष्ट होता है । उन दिनों सबसे श्रेष्ठ रावण ब्रम्हा , मायारूपी अरण्य को समूल नाश करने के कारण उनका नाम रावण रखा गया । 
<br><br>
रावणब्रम्हा महामेधावी थे । ब्रम्हविद्या शास्त्र , ज्योतिस शास्त्र , राजनीति , आयुर्वेद , संगीत ... इत्यादि कई क्षेत्रों में उन्हें ' मेधावी , बहुमुखी प्रज्ञाशाली ' नाम प्राप्त था । दस मेधावियों के मस्तक में विद्यमान ज्ञानशक्ति , बुद्धिमत्ता उनके अन्दर नजर आते थे । इसलिए उन्हें उन दिनों बड़े ज्ञानियों ने " दसकंठ " कह कर सम्मान के साथ संबोधित किया करते थे । रावण के दस सिर थे कहना पूर्णरूप से असत्य है । रावण के सूक्ष्मरूप में दस कंठ थे , किन्तु भौतिक रूप में सभी की तरह एक ही सिर था । 
<br><br>
त्रैत योग में इन्दू महासागर में दैवशक्ति विद्यमान होने की बात केवल रावण को ज्ञात था । इसलिए रावणब्रम्हा अक्सर समुद्र स्नान करने जाया करते थे । इन्दू महासागर में स्नान करने से दैवशक्ति उनके मस्तक में पहुँचेगी रावण  ब्रम्हा जानते थे । क्योंकि उन दिनों इन्दू महासागर में उतनी शक्ति विद्यमान थी । जबकि आज वह शक्ति वहाँ विद्यमान नहीं है । त्रिकालज्ञानी रावणब्रम्हा ने ज्ञान चिन्ह के रूप में उस सागर का नाम “ इन्दू " रखा । उनके मृत्यु के उपरान्त भी उन्होंने अपनी आत्मशक्ति को इन्दू महासागर में विद्यमान रखा । समय गुजरने के साथ देश का नाम ' इन्दू ' से ' हिन्दू ' में बदल दिया गया । साथ ही सागर का नाम भी ' हिन्दू ' कर दिया गया । इस कारणवश रावणब्रम्हा की आत्मशक्ति उस स्थान से हट कर आज अमेरिका के निकट ' अटलांटिक महासागर में विद्यमान है । त्रैत ज्ञान के ज्ञाता रावणब्रम्हा की आत्मशक्ति ने जीवात्मा , आत्मा , परमात्मा अर्थात् त्रैत सिद्धान्त के प्रतीक के रूप में सागर में त्रिकोणाकार बना । आज “ बरमुड़ा ट्रायंगल " के नाम से जाना जाता रहा है । उनका जीवन जनन से लेकर मरण तक ब्रम्हविद्या प्रमाणन से ही गुजरता चला गया ताकि समस्त मानव जाति के लिए मार्ग दर्शन बना रहे । वह दैवशक्ति ही आत्मशक्ति के रूप में , चैतन्य शक्ति के रूप में , वैताकार के रूप में , आज भी फ्लोरिडा के निकट बरमुडा ट्रायंगल के रूप में विद्यमान है । उत्तर अटलांटिक महासागर में एक स्थान पर स्थित होकर वह शक्ति , पूरे भूमंडल में व्याप्त प्रकृति के भाग अर्थात् पंच महाभूतों को चैतन्य प्रदान कर कब , कहाँ , किस प्रकार से उन से कार्य करवाना है , उस प्रकार से कार्य करवाया जाता है ।  
<br><br>
ईश्वर का अर्थ है अधिपति । पूरे विश्व के अधिपति निराकार परब्रम्ह पुरुषोत्तम का दूसरा रूप ईश्वर लिंग की पूजा किस प्रकार से करना है सूचित करने निमित्त रावणब्रम्हा ने ईश्वर लिंग की आराधना कर हम सभी के लिए मार्गदर्शक बने । इतना ही नहीं उन्होंने अन्य देवताओं की आराधना नहीं की । दूसरे देवताओं की आराधना करनेवालों का सदा खंडन किया करते थे । उन्होंने सदा योग किया , तपस्या तो उन्होंने किया ही नहीं । 
<br><br>
सूरों का अर्थ सूरा पान करनेवाले , तथा असूरों का अर्थ सूरा पान ना करनेवाले । रावणब्रम्हा किसी भी गलत आदत के आदी नहीं थे कहने निमित्त बड़े ज्ञानियों ने उन्हें ' रावणासूर ' कह कर संबोधन करते थे । किन्तु उनसे शत्रुता रखने वाले आर्यों ने असूर शब्द में बदलाव कर असूर का मतलब राक्षस कहकर भाष्य बताया । बाकि मानव जाति ने उसे सत्य मान लिया । ऊँचे कुल में " रावण " का जन्म हुआ उन्हें “ पौलस्य ब्रम्हा " कहकर संबोधित किया जाता था । वे ब्रम्हत्व के ज्ञाता विशुद्ध द्राविड़ ब्राम्हण थे । फिर भी उन्हें राक्षस क्यों कहा गया था ? 
<br><br>
रावणब्रम्हा के साथ आर्यों की शत्रुता ही इसका मुख्य कारण रहा है । आर्यों द्वारा प्रोत्साहित ४ अधर्मों को ( चरण , मंत्रपठन , तपस्या , दान ) द्राविड़ेश्वर खंडन करते थे । उनके आचरणों में बाधाएँ उत्पन्न करते थे । तीन धर्मों ब्रम्हयोग , कर्मयोग , भक्तियोग को प्रोत्साहित करते थे । ब्रम्हविद्या शास्त्र के अनुसार ऊपर कहे गए चार अधर्म दैवमार्ग अर्थात् मोक्ष मार्ग के विरुद्ध हैं , तीन धर्मों के आचरण ही मोक्ष का मार्ग सूचित करनेवाले रावणब्रम्हा ने अधर्मों को खंडन करने के कारण बैरी आर्यों ने उनके बारें में दुष्प्रचार करते रहें । आर्यों ने अधर्मों , यज्ञों , वेदों के अध्ययन , तप , दानों को प्रवेश करवाकर , दैवज्ञान को कलुषित करने की ठानी , रावणब्रम्हा ने आर्यों के प्रयासों का मुँह तोड़ जवाब दिया अधर्म  बताया । धर्मों में ग्लानि अर्थात् ज्ञान में कलुषित को निकालने के लिए आये भगवान थे रावण ब्रम्हा , स्पष्ट होता है । ' ब्रम्हज्ञान ' के धनी को ब्राम्हण कहना चाहिए । ब्रम्हज्ञान के मुताबिक कोई भी मनुष्य हो वह ब्राम्हण कहलायेगा , कुलों में ब्राम्हण कुल होता ही नहीं । तीन आत्माओं के ज्ञान के जानकार जो कोई भी हो उन्हें द्राविड़ ब्राम्हण कहा जायेगा । वेदों , यज्ञों के ज्ञान के जानकार जो कोई भी हो उन्हें आर्य ब्राम्हण कह सकते हैं । सम्पूर्ण ज्ञानी रावणब्रम्हा स्वच्छ ब्राम्हण थे । वे एक देश के राजा थे , सारे द्राविड़ों के नेता बनकर ब्राम्हणों के अन्दर दैवभक्ति , ज्ञानशक्ति में कमीं न आ जाय पर्यवेक्ष करते थे । श्री लंका में रहनेवाले लोगों से रोग भयभीत होते थें । कोई भी रोग लंका के निकट जाने से डरता था । त्रैता योग में उतरे दैवांश रावण ब्रम्हा जी अपने बुद्धि बल को मंत्रशक्ति में बदल कर पुष्पक विमान तैयार कर उसमें बैठकर विविध प्रान्तों में प्रयाण करते हुए सबै तक ब्रम्हज्ञान पहुँचाते थे । 
<br><br>
इस प्रकार से पूरा दक्षिण भारत रावणब्रम्हा के अधीन में हुआ करता था । हर कोई ज्ञानियों की भांति आचरण किया करते थे । कोई भी मनोकामना निमित्त यज्ञ कर रहा हो रावणब्रम्हा के अनुचर वहाँ पहुँचकर भंग कर देते थे , उस यज्ञ के अधिपति ग्रह शक्तियों ने भी रावणब्रम्हा के अनुचरों का लेश मात्र भी सामना न कर अपना मदद सूचित करते थे । आर्यों के प्रोत्साहन पाकर कोई भी अधर्म आराधनाएँ कर रहा हो उन्हें रावणब्रम्हा , उनकी सेना बाधाएँ डालते थे । लंकेश्वर , आर्यों को यम के जैसा नजर आते थे । दक्षिण भारत में आर्यों ने अपने आर्य प्रभाव को बढ़ावा देने के लिए यज्ञों , वेदों के अध्ययन ज्यादा से ज्यादा करवाने  लगें । इस क्रम में यज्ञ रक्षण के लिए विश्वामित्र ने राम जी को अपने साथ ले गये । छोटी उम्र में ब्रम्हज्ञान विहीन राम जी यज्ञरक्षण करने गये , अधर्म के मार्ग में बाधा बने रावण , तथा उनके अनुचरों का वध कर दिया गया । राम के जन्म से पहले से ही आर्यों की उपस्थिती थीं , द्राविड़ों से वैर इस घटना से तीव्र होने लगा । इतिहास गवाह है । 
<br><br>
रामायण को ग्रंथरूप में आर्य वाल्मिकी ने रावणब्रम्हा को दुष्ट , कामांध कहकर चित्रित किया गया । उस दिन रावण सीता को ले जाना वास्तविक होने पर भी , उन्होंने किस उद्देश्य के साथ सीता को ले गये , हम यथार्थ से अनभिज्ञ रहकर बातें बनाने का मतलब है हममें निपुणता की कमीं । इच्छा मरण प्राप्त रावण को , राम के हाथों मरण प्राप्त होना रावण को पहले से ही ज्ञात था , इसलिए सीता को लंका लेकर आने की बात रावण ने अपनी पत्नी मंडोदरी को पहले से ही कह रखा । था । उस विषय को नजरअंदाज कर सीता को गलत उद्देश्य के साथ रावण लंका ले गये आर्यों ने गलत प्रचार कर लिखा । ८० से ज्यादा उम्र वृदावस्था में रावण अत्यन्त अनुभव शाली , मेधावी थे उन्होंने लगभग बीस से भी ज्यादा स्त्रियों को सीता की परिचर्या करने के लिए , साथ में रहने की व्यवस्था कर रखी थी । अच्छे वातावरण के लिए सीता को अपने निवास से ५० किलोमीटर दूर उद्यान वन में रखा गया । सप्ताह में एक बार पत्नी समेत अशोक वन जाकर एक पिता की भांति क्षेम समाचार पुछ कर सीता की आरोग्य विषय जान कर उन्हें कोई भी कमीं न हो सके अपने लोगों को हिदायतें देकर लौट जाते थे । रावण ब्रम्हा ने सीता को अपने भविष्य के बारें बताते हुए कहा कि राम को आपके कारण यहाँ आना   पड़ेगा , उनका ( रावण ब्रम्हा ) मरण कब होगा पहले से ही सीता से कह रखा था । राम की किस प्रकार की मन : स्थिती है भविष्य में तुम्हें ज्ञात हो जायेगा सीता से कहा था । सीता ने कभी भी रावण को गलत व्यक्ति कहकर आरोप नहीं लगाया । लगभग ग्यारह वर्ष वाल्मिकी आश्रम में रहनेवाली सीता , बिना किसी सुख सुविधा वाले कुटीर में अनेक कष्टों को झेलती रही , जबकि रावण के काल में लंका में बिना किसी कष्ट के रहने की बात अनेकों बार सोचती रही । सीता ने कभी भी रावण को बुरा व्यक्ति नहीं कहा , फिर भी रामायण की रचना करनेवाले आर्य थे इसलिए रावणब्रम्हा को दुष्ट कहते हुए चित्रित करते रहे । वास्तव में रावण दाग रहित जीवन व्यतीत करनेवाले ब्रम्हज्ञानी थे । भविष्य के बारें में जाननेवाले कालज्ञानी को , योगिश्वर को , इच्छा मरण प्राप्त रावण को , क्या नीति न्याय , ज्ञान , धर्म , ज्ञात नहीं होगा ? पुछ रहे हैं । रावण ब्रम्हा जी की श्रेष्ठता को लेश मात्र भी ना पहचान कर उन्हें एक अज्ञानी , दुष्ट , कामांध , राक्षस के रूप में उन दिनों आर्य कवियों ने द्राविड़ों पर प्रान्तीयता भेदभाव के कारण रावण ब्रम्हा को बुरा कहते हुए चित्रित कर लिखा गया , प्रचार किया गया । आज भी लोग उनका समर्थन करते रहे हैं किसी ने भी अपनी बुद्धि से लेश मात्र भी विचार न किया कि इस बारें में कितना सच है ? कितना झूठ है ? । पंडितों ने मुर्खों ने , विवेकवानों ने , विवेकहीनों ने रावणब्रम्हा को साधारण मानव से भी हीन समझते हुए बातें कर रहे हैं । 
<br><br>
इसी कारणवश सागर में विद्यमान आत्मशक्ति को मनुष्यों की अज्ञानता पर क्रोधित होकर , इन्दू महासागर को छोड़कर , अमेरिका के निकट अटलांटिक  महा सागर में पहुँच कर “ बरमुड़ा ट्रायंगल " के नाम से उसके आस पास जानेवालों को दुर्घटना का शिकार बनाती है । कुछलोगों को दैवज्ञान करने के लिए दूसरे ग्रह में भेजती है । ज्ञान के ज्ञाताओं को बिना कोई बाधा डाले प्रयाण करने में मदद करती है । परमात्मा के पालन में मुख्य भूमिका निभा रहे मेघों ने इस त्रैताकार शक्ति को स्पर्श कर शक्ति प्राप्त कर आते हैं । त्रैताकार शक्ति को स्पर्श कर पूर्ण रूप से उत्तेजित होकर मेघ धरती के प्राणियों पर अपना प्रभाव डालते हैं । इस दैविक शक्ति का विवरण किसी साइन्स ने नहीं दिया । सूपर साइन्स ( ब्रम्हविद्या शास्त्र ) मात्र ही दे सकता है । 
<br><br>
उस समय लंका के सारे वासी दैवज्ञान के ज्ञाता थे , राक्षस स्वभाव वाले नहीं थें । वहाँ के वासी ज्ञानी होने के कारण उस देश का " श्री " शुभ सूचक अक्षर जोड़ कर " श्री लंका " कहकर संबोधित किया जाता है । श्री का अर्थ मोक्ष । आज भी श्री लंका में रावणब्रम्हा के समय के , उनके राज्य में निवसित नागरिकों के वंश के लोग मौजूद हैं । वे स्वच्छ तेलुगु भाषा में ही बातें करते हैं । उनका श्री लंका में संचार जातियों में परिगणना की जाती है यह नग्न सत्य है । द्राविड़ जाति के रावणब्रम्हा के समय में ही तेलुगु भाषा में बातें की जाती थी आज भी लोग कहते हैं । इसलिए रावण के चरित्र को वक्रकृत करनेवाले लोग , अब भी निष्पक्षपात भाव से शोध कर ज्ञात करने का प्रयास करें तो रावण कितने उन्नत व्यक्ति थे , तेलुगु भाषा कितनी प्राचीन भाषा है निरूपित हो जायेगा । श्री लंका में संचार जातियों में परिगणना होनेवाले तेलुगु लोग आज भी रावणब्रम्हा की आराधना करते हैं । वे रावण को राक्षस नहीं मानते , हम भी उन लोगों से सहमत हैं । सृष्टि के आदि में  ही परमात्मा ने सूर्य को ज्ञान बोध किया था । सूर्य के द्वारा मनु को , मनु के द्वारा समस्त लोक को अवगत करवाया गया । उस प्रकार के ज्ञान को सम्पूर्ण रूप से आचरण करनेवाले व्यक्ति मात्र रावण ब्रम्हा थे । इस बात को आसियों ( आर्यों ) को सहन ना हो सका रावण की परिगणना राक्षस में कर दिया गया । रावणब्रम्हा धर्मपरायण , धर्म युद्ध करनेवाले व्यक्ति के रूप में रावणब्रम्हा का सम्मान करनेवाले तेलुगु जाति के लोग आज भी श्री लंका में मौजूद हैं । रावण ब्रम्हा को मरण प्राप्त नहीं हुआ , घायल हुए हैं वापस सजीव रूप में कभी भी आ सकते हैं उनलोगों का विश्वास है । राम , रामायण में वानरों हों , या भल्लूको हो , या फिर कोई अन्य जंतु हो किसी ने युद्ध नहीं किया , इतिहास को वक्रकृत लिखा गया है , यह आसियों का षड़यंत्र है हमारे पास सबूत हैं , कह रहे हैं । पूर्व पूरे भारतवर्ष की द्राविड़ जाति में परिगणना होती थी कई इतिहास के आधारों से निरूपित होता है । कालक्रम में आसियों अर्थात् आर्यों ने गुजर बसर के लिए भारतवर्श में प्रवेश किया । गुजर बसर के लिए आये आसियों ने परमात्मा धर्मों को , ज्ञान के निकट रहनेवाले द्राविड़ों को धोखे से , अत्याचारों से काबू में कर लिया गया जो आज आर्य कहला रहे हैं । आर्यों के आने से द्राविड़ अपना अस्तित्व खो कर , दैवज्ञान से दूर होकर आसियों के षड़यंत्रों के कारण बलि हो गये , अधर्मों को द्राविड़ों पर थोपा गया । इस कारण धीरे - धीरे द्राविड़ अपना अस्तित्व खोते चले गये , द्राविड़ होने का अहसास खो बैठने की स्थिती में आ पहुँचे हैं । 
<br><br>
द्राविड़ देश के अंर्तभाग श्री लंका में रावणब्रम्हा पालन में प्रजा जन कहलाने वाले लोग आज भी कभी भी रावणब्रम्हा वापस लौटेंगे , उनका मरण नहीं   हुआ , वे कभी भी वापस लौट कर धर्म को पुनः जीवित करेंगे उन्हें विश्वास है । हमारा कहना भी यही है कि आत्मशक्ति ही वैताकार शक्ति के रूप ( बरमुड़ा ट्रायंगल ) में मौजूद हैं वे , धर्मों को पुनः स्थापित करने के लिए अवतरित होंगे , वे जीवात्मा नहीं हैं उन्हें मरण नहीं है इसलिए ओझल हुए सत्य को बाहर निकाल कर हम सब को अवगत करवायेंगे । रावणब्रम्हा अज्ञानी नहीं थे बल्कि सम्पूर्ण दैवज्ञानी थे , वे दुष्ट नहीं बल्कि भद्र पुरूष थे , वे शुद्र नहीं बल्कि सच्चे सद् ब्राम्हण थे , वे सामान्य व्यक्ति नहीं बल्कि दैवधर्मों को पुनः स्थापित करने के लिए अवतरित योगिश्वर थे , हम उन्हें भगवान कहकर सूचित करना चाहते हैं , सूचित कर रहे हैं ।  
</p>
  `},
{
  text:`
  <ion-row>
<ion-col class="ion-text-center">
<h1><b>रावणब्रम्हा द्राविड़ ब्राम्हण संघ के उद्देश्य </b></h1>
</ion-col>
<ion-row>
<br>
१ विश्व के सृष्टिकर्ता यनि परमात्मा या विधाता सब जनों के लिए एक ही हैं इस सत्य को सर्व मानव जाति को अवगत करना । 
<br><br>
२ परमात्म ज्ञान ब्रम्हविद्या शास्त्र अर्थात् दैव ( परमात्म ) ग्रंथों में धर्मों को पूरे विश्व में प्रचार करना । 
<br><br>
३ दैवज्ञानी , त्रिकालज्ञानी , अपरब्रम्हा , बहुमुखी प्रज्ञाशाली , तीन या त्रि योगों को , त्रि आत्माओं के ज्ञान के ज्ञाता योगिश्वर , आदि द्राविड़ ) ब्रम्हाण , ' द्राविड़ेश्वर रावणब्रम्हा की उत्कृष्टता को अवगत करना । 
<br><br>
४ त्रिकालज्ञानी , अपर ब्रम्हा श्री रावणब्रम्हा पर अब तक बुरे प्रचार का पलट कर जवाब देना । 
<br><br>
५ द्राविड़ शब्द में त्रैत सिद्धान्त अर्थात् त्रि आत्माओं का विवरण मौजूद है द्रा , वि , इ ये तीनों अक्षर परमात्मा , आत्मा , तथा जीवात्मा सूचित करते हैं , स्पष्ट कराना। 
<br><br>
६ द्राविड़ शब्द का विशुद्ध अर्थ सूचित कर , क्षीण हो रहे द्राविड़ों के पूर्व वैभव को पुनः जीवित करना । 
<br><br>
७ ब्रम्हज्ञान के धनी ही शुद्ध ब्राम्हण हैं यह सत्य समाज को अवगत कराना । 
<br><br>
८ ब्रम्हविद्या शास्त्र में दैवज्ञान के आधार पर सभी मतों के लोगों को समन्वय में लाना ।  
<br><br>
९ परमात्मा , और भगवान दोनों में अंतर अवगत कराना । 
<br><br>
१० परमात्मा मनुष्य ( भगवान ) रूप धारण कर प्रत्यक्ष हो सकते हैं किन्तु मनुष्य जब तक मोक्ष प्राप्त न कर ले परमात्मा नहीं बन सकता समाज को अवगत कराना । 
<br><br>
११ ब्रम्हविद्या शास्त्र में वाक्यों को परमात्म के विधानों में भाव को विशद कर यनि स्पष्ट रूप में कहना । 
<br><br>
१२ ब्रम्हविद्या शास्त्र का अध्ययन , आचरण कर्म क्षेपण के लिए हैं अवगत कराना । 
<br><br>
१३ वेदों , पुराणों , इतिहासों का पठन , काल क्षेपण के लिए होते हैं अवगत कराना ।
<br><br>
१४ ब्रम्हाविद्या शास्त्र में कथित धर्म , दैवधर्म हैं वे प्रत्येक मनुष्य से संबंधित हैं , आचरण करने में अत्यंत सरल है , अवगत कराना । 
<br><br>
१५ अधर्म चार हैं , धर्म मात्र तीन हैं , धर्म का आचरण मुक्ति का मार्ग , यही मानव का मुख्य उद्देश्य होना चाहिए सूचित करना । ( भगवद् गीता विश्व रूप संदर्शन योग में ४८ , ५३ श्लोक ) 
<br><br>
१६ मानव जन्म के प्रधानता को अवगत कराना , आपका पहुँचनेवाला आखिरी पड़ाव मोक्ष है , मोक्ष मार्ग पर अग्रसर होने से ही मानव जन्म को उत्कृष्ट जन्म कहा जायेगा अवगत कराना । 
<br><br>
१७ तीन भागों में मौजूद दैव ग्रंथों में ज्ञान के विषयों को सम्पूर्ण रूप से ज्ञाता ही शुद्ध आत्मज्ञानी बन सकते हैं समाज को अवगत कराना । 
<br><br>
१८ ब्रम्हविद्या शास्त्र का प्रपंच ( दुनिया ) में किसी भी किताब के साथ कोई तुलना न हो , देखना । 
<br><br>
१ ९ ब्रम्हविद्या शास्त्र में उत्कृष्ट तथा अप्रश्नित दैवज्ञान को समाज में पहुँचाना , तथा सभी को ब्रम्हत्व का मार्ग अवगत कराना । 
<br><br>
२० ब्रम्हा का तात्पर्य बड़ा , ब्राम्हण का तात्पर्य भी बड़ा , छोटे को बड़ा बनाना । ही ध्येय रखना । 
  
  `
}, 
{ 
  text:` 
  <ion-row>
  <ion-col class="ion-text-center">
  <h1>Ravana Brahma Temples</h1>
  </ion-col>
  </ion-row>
  `
  },
  {
    text: ``
  },
  {
    text: ``
  },
  {
    text: ` 
  <ion-row>
  <ion-col class="ion-text-center">
  <h1>రావణ బ్రహ్మ గురించి గ్రంథములు 44</h1>
  </ion-col>
  </ion-row>
  `
  }    
]
 

}
