import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class TamilGlobalService {

  constructor() { }
  public menu: any = [
    { title: "ராவணப்பிரம்மா", itemNumber: 0, pathName: "tamil-content", chapterNumber: 0, subs: null, icon: 'information', language: 'tamil' },
    { title: "சமூகத்தின் நோக்கம்", itemNumber: 1, pathName: "tamil-aims", chapterNumber: 0, subs: null, icon: 'information', language: 'tamil' },
    { title: "ராவணப்பிரம்மா கோவில்", itemNumber: 2, pathName: "tamil-temples", chapterNumber: 0, subs: null, icon: 'information', language: 'tamil' },
    { title: "காணொளிகள்", itemNumber: 3, pathName: "videos", chapterNumber: 0, subs: null, icon: 'camera', language: 'tamil' },
    { title: "பாடல்கள்", itemNumber: 4, pathName: "songs", chapterNumber: 0, subs: null, icon: 'camera', language: 'tamil' },
    { title: "கிரந்தங்கள்", itemNumber:5,pathName:"tamil-books",chapterNumber: 0, subs:null , icon: 'book-outline', language:'tamil' },
    { title: "அச்சு ஊடகம்", itemNumber:6,pathName:"print-media",chapterNumber: 0, subs:null , icon: 'information', language:'tamil' },
    //{ title: "கேள்வி பதில்கள்", itemNumber:5,pathName:"question-answer",chapterNumber: 0, subs:null , icon: 'information', language:'tamil' },


  ];
  menuContent: any = [
    {
      text: `
  <ion-row>
  <ion-col class="ion-text-center" style="color:maroon;">
    <h1> திராவிட பிராஹ்மண - இராவண பிரம்மா</h1><br>
  </ion-col>
</ion-row>
<p>
இராவண பிரம்மா ஒரு ஆதி ( திராவிட ) பிராம்ஹன , மேலும் திராவிடர்களுக்கு அதிபதி ( Dravideswara ) ஆவார் . உயர்ந்த யோகி மற்றும் உயர்ந்த யோக சக்தி கொண்டவர் ( Apara Brahma ) , மூன்று கால நிலைகளை அறிந்தவர் ( கடந்த கால , நிகழ்கால மற்றும் எதிர்கால ) , ஞானத்தை பெற்றவர் , மூன்று யோக நிலைகளை அறிந்தவர் ( ஞான யோகம் , கர்ம யோகம் , பக்தி யோகம் ) , முழுமையான ஆன்மீக ஞானம் பெற்றவர் . அறிவு கூர்மை படைத்தவர் பல்வேறு துறைகளில் தேர்ச்சி பெற்றவர் மற்றும் சாஸ்திர ஞானம் அறிந்தவர் . அவர் ஒரு பகவான் , மூன்று இயற்கை குணங்களை கடந்தவர் ( தாமச , ராஜச , சாதவிக் ) . இவர் திரேதா யுகத்தில் இலங்கையில் வசித்த விஸ்ரவாசா , கைகாசி தம்பதியினருக்கு முதல் குழந்தையாக பிறந்தார் .
</p>
<p>
இராவண பிரம்மா ஒரு சாதாரண நபர் அல்ல . அவர் இயற்கையை கடந்த மற்றும் தெய்வீக சக்தி கொண்டவர் . இராவண பிரம்மாவின் பிறப்பு ஒரு பெரிய இரகசியம் , தெய்வீக சக்தியான ஆத்ம ( Aathma ) சக்தி இலங்கை சுற்றியுள்ள இந்து ( Indu ) மகா பெருறுகடலில் இருந்து மனித வகையான உருவெடுத்து ஆன்மீக கல்வியில் ஆர்வம் உருவாக்க , இந்த பூமியில் தெய்வீக அறிவு என்றால் என்ன ? யோகா என்றால் என்ன ? மற்றும் இறுதியில் மோக்க்ஷா என்றால் என்ன ? என ஒரு எடுத்துக்காட்டாக இந்த பூமியில் உள்ள மக்களுக்கு தெரிவிக்க மற்றும் நேரடி ஆதாரத்தை கொடுக்க கடவுள் ஞானம் , யோகா , மோக்க்ஷ பாதையைக் காட்ட அந்த தெய்வீக சக்தியே இராவண பிரம்மாவாக மற்றும் பிரம்ம வித்யா சாஸ்த்திரம் அறிந்த உண்மை பிரதிநிதியாக பிறந்தார் . அவரது பிறப்பு அம்மா அப்பாவின் தொடர்பு இல்லை , ஆகையால் அந்த சக்தியை நாம் பிரம்மா என்று அழைக்கின்றோம் . கடைசியில் , பிரம்ம வித்யா சாஸ்திரம் நிபந்தனைகளுக்கு ஏற்ப அவர் இறந்து முக்தியடைந்தார் . இதிலிருந்து இராவண பிரம்மா ஒரு சாதாரண நபர் அல்ல , ஒரு மிக பெரிய மனிதர் மற்றும் கண்ணுக்கு தெரியாத தெய்வீக சக்தி என்றும் ஆன்மீக விழிப்புணர்வின் ஒரு முன்மாதிரியாக , மற்றும் மக்களுக்கு யோகா முறையின் 
( Yoga ) வழியாக பிறப்பு / இறப்பு சூழலில் இருந்து விடுதலை பெறுவதற்கான பாதையை தெரிவித்தார் . ஆனால் மக்கள் இராவண பிரம்மா பிறந்த பெருந்தன்மையும் மற்றும் நோக்கத்தை உணர முடியவில்லை . இராவணன் என்பது அவர் பெயர் மற்றும் பிரம்மா என்றால் ஒரு மரியாதைக்கான விருது . ஆன்மீக அறிவு படி , பிரம்மா என்றால் " மிக பெரிய " என பொருள் உள்ளது . இந்த உலகில் யாரும் கடவுளைவிட மிகபெரியவர் இல்லை . ஆதலால் பிரம்மா என்ற வார்த்தை கடவுளின் உபப் பெயர் . ஒரு நல்லொழுக்கமுள்ள நபர் ' பிரம்மா " என்றும் , மற்றும் கடவுள் போன்றவர் ( அல்லது ) எல்லா ஜீவ ராசிகளின் அதிபதிக்கு ( Eshwara ) இணையானவர் . நாம் இராவணன் என்ற வார்த்தையை பிரித்தால் அது இரண்டு வார்தையாகும் . ( Ra + Vana ) வணா என்ற வார்த்தை காடு என்று பொருள் மற்றும் ரா ( Ra ) வின் பொருள் ' அழிவு ' ஆகும் . இராவண ( Ravana ) என்றால் மாயை ( Maya ) என்ற காட்டை அழிக்க வல்லவர் என்று பொருள் இன்னும் விபரமாக சொன்னால் மாயை ஒரு காட்டுக்கு ஒப்பிட்டு மற்றும் குணத்தை மரங்கள் என்று கூறலாம் . ஒரு நபர் எவர் ஒருவர் குணம் என்ற மரங்கள் கொண்ட காட்டை அழிக்க வல்லவரோ , அவரை நாம் இராவணன் என்று அழைக்கிறோம் . அந்த நேரத்தில் , அவர் ஒரு மாயை என்னும் காட்டை அழிக்கும் தலைவனாக திகழ்ந்தார் . ஆகையால் அவரை இராவண பிரம்மா ( Ravana Brahma ) என்று அழைக்கின்றோம் . 123456789 இராவணன் ஒரு பிரபலமான அறிவுகூர்மை படைத்தவர் மற்றும் பல்வேறு துறைகளில் தேர்ந்தவர் ஆவார் . மேலும் ஆன்மீக கல்வி ( Brahma Vidya Shastra ) , ஜோதிடம் , அரசியல் , ஆயுர்வேதம் , இசை போன்ற துறைகளில் தேர்ந்தவர் . இராவணன் அறிவு திறன் மற்றும் ஆன்மீக சக்தி பத்து நபர்களின் அறிவு திறனுக்கு சமம் ஆகும் . அதனால் ஞானம் கொண்ட பெரியவர்கள் அந்த நேரத்தில் , ஒரு மரியாதை நிமித்தமாக , இராவணன் பத்து தலைகள் கொண்டவன் ( Dasa Kanta ) என்று அழைக்கத் தொடங்கினர் . ஆனால் உடல் ரீதியாக அவர் பத்து தலைகள் கொண்டவர் என்ற அர்த்தம் இல்லை . ஆனால் ஒரு பார்வையில் பத்து தலைகள் கொண்ட அறிவு கூர்மை சிறப்பு வாய்ந்தவர் என்பது சரியானது . ஆனால் இராவணன் ஒரு தலை உள்ளவர் ஆவார் .
விடுதலை பெறுவதற்கான பாதையை தெரிவித்தார் . ஆனால் மக்கள் இராவண பிரம்மா பிறந்த பெருந்தன்மையும் மற்றும் நோக்கத்தை உணர முடியவில்லை . 
<br><br>
இராவணன் என்பது அவர் பெயர் மற்றும் பிரம்மா என்றால் ஒரு மரியாதைக்கான விருது . ஆன்மீக அறிவு படி , பிரம்மா என்றால் " மிக பெரிய " என பொருள் உள்ளது . இந்த உலகில் யாரும் கடவுளைவிட மிகபெரியவர் இல்லை . ஆதலால் பிரம்மா என்ற வார்த்தை கடவுளின் உபப் பெயர் . ஒரு நல்லொழுக்கமுள்ள நபர் ' பிரம்மா " என்றும் , மற்றும் கடவுள் போன்றவர் ( அல்லது ) எல்லா ஜீவ ராசிகளின் அதிபதிக்கு ( Eshwara ) இணையானவர் . நாம் இராவணன் என்ற வார்த்தையை பிரித்தால் அது இரண்டு வார்தையாகும் . ( Ra + Vana ) வணா என்ற வார்த்தை காடு என்று பொருள் மற்றும் ரா ( Ra ) வின் பொருள் ' அழிவு ' ஆகும் . இராவண ( Ravana ) என்றால் மாயை ( Maya ) என்ற காட்டை அழிக்க வல்லவர் என்று பொருள் இன்னும் விபரமாக சொன்னால் மாயை ஒரு காட்டுக்கு ஒப்பிட்டு மற்றும் குணத்தை மரங்கள் என்று கூறலாம் . ஒரு நபர் எவர் ஒருவர் குணம் என்ற மரங்கள் கொண்ட காட்டை அழிக்க வல்லவரோ , அவரை நாம் இராவணன் என்று அழைக்கிறோம் . அந்த நேரத்தில் , அவர் ஒரு மாயை என்னும் காட்டை அழிக்கும் தலைவனாக திகழ்ந்தார் . ஆகையால் அவரை இராவண பிரம்மா ( Ravana Brahma ) என்று அழைக்கின்றோம் .  
<br><br>
இராவணன் ஒரு பிரபலமான அறிவுகூர்மை படைத்தவர் மற்றும் பல்வேறு துறைகளில் தேர்ந்தவர் ஆவார் . மேலும் ஆன்மீக கல்வி ( Brahma Vidya Shastra ) , ஜோதிடம் , அரசியல் , ஆயுர்வேதம் , இசை போன்ற துறைகளில் தேர்ந்தவர் . இராவணன் அறிவு திறன் மற்றும் ஆன்மீக சக்தி பத்து நபர்களின் அறிவு திறனுக்கு சமம் ஆகும் . அதனால் ஞானம் கொண்ட பெரியவர்கள் அந்த நேரத்தில் , ஒரு மரியாதை நிமித்தமாக , இராவணன் பத்து தலைகள் கொண்டவன் ( Dasa Kanta ) என்று அழைக்கத் தொடங்கினர் . ஆனால் உடல் ரீதியாக அவர் பத்து தலைகள் கொண்டவர் என்ற அர்த்தம் இல்லை . ஆனால் ஒரு பார்வையில் பத்து தலைகள் கொண்ட அறிவு கூர்மை சிறப்பு வாய்ந்தவர் என்பது சரியானது . ஆனால் இராவணன் ஒரு தலை உள்ளவர் ஆவார் .   
<br><br>
திரைதா யோகம் ( திரேதா யுகம் ) தின் போது இராவண பிரம்மா ஒருவருக்கு மட்டுமே நம் இந்து மகா பெருங்கடல் ( Great Indian Ocean ) தெய்வீக சக்தி நிரப்பப்பட்டது என்று அறிந்தவர் ஆவார் , எனவே அவர் அடிக்கடி அந்த கடலில் குலிக்கும் பழக்கம் கொண்டார் . அந்த நேரத்தில் அவர் மட்டுமே இந்திய பெருங்கடலில் குளிப்பதால் அந்த தெய்வீக சக்தி ஒரு நபரின் உடலில் நுழையும் என்று அறிந்தவர் . அந்த நாட்களில் இந்திய பெருங்கடல் மிகவும் சக்தி வாய்ந்ததாக இருந்தது . ஆனால் இன்று அந்த தெய்வீக சக்தி இல்லை . இராவண பிரம்மா ஒரு மிக சிறந்த ஆன்மீகவாதி மற்றும் மூன்று காலங்களை அறிந்தவர் ( கடந்த காலம் , நிகழ் காலம் , எதிர் காலம் ) ( Trikala Gnani ) , அவர் இந்து ( Indu ) கடல் என்று அழைக்க காரணம் ஒரு தெய்விக சக்தி படைத்ததால் மற்றும் அவரது மரணம் கடந்து தனது " ஆத்ம சக்தி " இந்த பெருங்கடலில் இருக்கும் படியாக அமைந்தது . பின்னர் பல ஆண்டுகள் கடந்த பிறகு , நாட்டின் பெயர் " Indu " வை ஹிந்து ( Hindu ) என்றும் ஹிந்து மதம் என மாற்றிக்கொண்டனர் . அதனால் இராவண பிரம்மா ஆத்ம சக்தி இந்திய பெருங்கடலை விட்டு கலியுகத்தில் அமெரிக்காவிலுள்ள அட்லாண்டிக் பெருங்கடலில் மாற காரணம் ஆனது . 
<br><br>
இராவண பிரம்மாவின் ஆன்மீக சக்தி , மூன்று ஆத்மா ஞானம் பெற்றவராக ( மூன்று ) ஆத்மா கோட்பாடு ( அதாவது ஜீவாத்மா , ஆத்மா , பரமாத்மா ) , மற்றும் ' முக்கோண வடிவ களம் ' ஆக இன்று ' பெர்முடா முக்கோணம் ' என்ற பெயரில் பிரவியது . இராவண பிரம்மா வாழ்க்கை பிறப்பு முதல் இறப்பு வரை ஒரு உண்மையான பிரம்ம வித்யா சாஸ்திரதின் படி மற்றும் அனைத்து உயிரினங்களுக்கு வழிகாட்டியாக இருந்தார் . அந்த தெய்வீக சக்தி இன்னும் ஒரு ஆன்மீக சக்தியாகயும் , வாழும் சக்தியாக இன்றும் புளோரிடா அருகே உள்ள " பெர்முடா முக்கோணம் " ஆக உள்ளது . இந்த பெர்முடா முக்கோணம் இப்போது வட அட்லாண்டிக் பெருங்கடலின் மையத்தில் ஐந்து ( 5 கூறுகள் ) பூதங்கள் ஆக வியாபித்திருக்கிறது , அவை கிரகம் , உபகிரகங்கள் , உபபூதாஸ் ( மோகங்கள் , நோய்கள் ) ஆக உள்ளது . இந்த ஆன்மீக சக்தி பெர்முடா முக்கோணத்தில் இருந்து உயர்ந்த சக்தியை இயற்கையின் எல்லா பாகங்களுக்கு கொடுக்கிறது . இது பூமி முழுவதும் பரவி உரிய வேலைகளை உரிய இடங்களில் மற்றும் உரிய நேரத்தில் செய்கிறது . 
<br><br>
ஈஸ்வரா ( Eshwara ) என்ற வார்த்தைக்கு பொருள் உரிமையாளர் / தலைவர் / இறைவன் . இராவண பிரம்மா முழு பிரபஞ்சத்தின் தலைவனான இறைவனை வழிபட்டார் . அவர் எங்கும் நிறைந்தவர் , பரபிரம்மம் , புருஷோத்தமாவான ஈஸ்வர லிங்க வடிவை வணங்கினார் . முறைப்படி எல்லா மனித இனத்துக்கும் வழிகாட்டும் பொருட்டு அவர் வழிபாடு ஈஸ்வரா லிங்க பாதையை வெளிப்படுத்தினார் . அவர் ஒரு போதும் குறுந் தெய்வத்தை வழிபட்டது இல்லை , மற்றும் அந்த வகையான வழிபாட்டை திடமாக மறுத்தார் . அவர் எப்போதும் கர்ம யோகம் செய்தவராக இருந்தார் . ஆனால் தியானத்தை ( Meditation ) செய்தது இல்லை .  
<br><br>
திரைதா ( Thraita ) யுகத்தில் உள்ள " சூரா " என்னும் ஒரு மதுபானம் , எடுத்துக் கொள்ளும் மக்கள் " சூராக்கள் " என்று அழைக்கப்பெற்றனர் . அந்த மதுபானத்தை எடுத்துக் கொள்ளாதவர்களை " அசுரர்கள் " என்றார்கள் . இராவண பிரம்மாவிற்கு எந்த கெட்ட பழக்கமும் இல்லாததால் அவரை " இராவண அசுரா " என்று அவருடைய மூப்பர்களால் அழைக்கப்பெற்றார் . ஆனால் இராவண பிரம்மா மீது பகை கொண்டிருந்த ஆரியர்கள் வேண்டுமென்றே " அசுரன் " என்ற வார்த்தைக்கு , " அரக்கன் " என பெயரிட்டு அழைத்தனர் . மக்களும் அதை உண்மை என நம்பத் தொடங்கினர் . இராவணன் , " Paulayya பிரம்மா " என்ற மிகப்பெரிய பரம்பரை குடும்பத்தி 2 பிறந்தவர் , அவர் " பிரம்மா " விடம் இருந்து ஞானம் பெற்ற ஓர் உண்மையா திராவிட பிராமணர் ஆவார் . எனவே , எப்படி அவரை ஒரு ராட்சசன் என்று சொல்ல முடியும் ? 
<br><br>
இராவண பிரம்மாவிற்கும் , ஆரியர்களுக்கும் உள்ள கடுமையான பகை என்னவென்றால் , திராவிட ஈஸ்வரத்தில் ( Dravideswara ) ஆரியர்கள் ஊக்கப்படுத்திய நான்கு அதர்மங்கள் ( Adharmas ) ஆன கடவுளுக்கு செய்யும் பூஜைகள் , வேத மந்திரங்கள் ஒதுதல் , தியானங்கள் , அறக்கட்டளை மற்றும் நன்கொடைகள் ஆகியவை வரும் பிறவிகள் நல்ல வசதிகள் வழங்கும் , ஆனால் மோட்சங்கள் தராத செயல்கள் மறுக்கப்பட்டது மற்றும் கண்டிப்பாக தடைசெய்யப்பட்டது . ஆனால் ராவணர் ஊக்குவித்த மூன்று தர்மங்கள் ( Dharmas ) ( கர்ம யோகம் , பிரம்ம யோகம் , பக்தி யோகம் ஆகியவை கர்மத்தை நீக்கி மோட்சத்தை கொடுக்கும் ) ராவண பிரம்மா , பிரம்ம வித்ய சாஸ்திரத்தில் ( Brahma Vidya Shastra ) அந்த நான்கு அதர்மங்களுக்கும் எதிரானது என்றார் . அவர் கூறிய மூன்று தர்மங்களுமே நல்ல பாதுகாப்பும் , மோட்சத்திற்கும் வழிவகுக்கும் என்றார் . இதன் காரணமாகவே இராவணர் ஆரியர்களால் தவறான சித்தரிக்கப்பட்டார் . மூன்று தர்மங்களை நிலைநாட்ட வேண்டும் என்ற ராவணா பிரம்மாவின் முயற்சியை நாம் திரைதா யுகத்தின் ( Threta Yuga ) பகவான் என்று கூறலாம் .   
<br><br>
எவர் ஒருவர் பிரம்ம ஞானம் ( Divine Knowledge ) பெற்றவரோ அவரை பிராமணர்கள் ( Brahmans ) என்று அழைக்கப்பெற்றனர் , ஆனால் பிராமணர் என்ற சமூகப்பிரிவு ஒன்று இல்லை என கூறலாம் . மக்கள் மூன்று ஆன்மாக்களை ( Souls ) ஜீவாத்மா , ஆத்மா , பரமாத்மா ( kshra , Akshara , Purushottama ) பற்றி தெரிந்து கொண்டவர்கள் திராவிட பிராமணர்கள் என்றனர் . அதே போல் வேதங்களையும் , கடவுளுக்கு செய்யும் பூஜை முறைகளையம் கற்றவர்கள் ஆரிய பிராமணர்கள் என்று அழைக்கப்பெற்றனர் . ராவணனுக்கு , பிரம்மஞானம் உள்ளதால் அவர் ஓர் உண்மையான பிராமணர் , ஆனால் அவர் ஒரு அரசர் என்பதால் திராவிட பிரமாணத்தையே வழி நடத்தி சென்றார் . அவர் கூறிய அந்த மூன்று ( Souls ) ஆத்மாகளையுமே பின்பற்றுமாறு தம் மக்களுக்கு அறிவுறுத்தினார் . அதுவே கடவுளை சென்றடையும் மேன்மையான வழி என்று கூறினார் . எந்த கொடிய நோய்களும் திராவிட பிராமணர்கள் மீது படவில்லை . இலங்கை மக்கள் அனைவரும் நலமுடன் இருந்தனர் . இராவணன் தன்னுடைய தெய்வ சக்தியை பயன்படுத்தி புஷ்பக விமானம் " ( Pushpaka Vimana ) ஒன்றை உருவாக்கினான் . அதைக் கொண்டு பூலோகத்தில் உள்ள அனைத்து இடங்களுக்கும் சென்று கடவுளின் ஞானத்தை பற்றி மக்களுக்கு எடுத்துரைத்தார் . 
<br><br>
இதன் மூலம் இராவணன் தென் தமிழகத்தின் திராவிட பிராமண இயக்கத்திற்கு தலைவர் ஆனார் . எல்லோரும் தெய்வீக வழிபாடு நடத்தி , ஞானத்தை பெற்றனர் . இராவண பிரம்மா வழி பின்பற்றுபவர்கள் யக்னா ( Yagna ) செய்தாலும் அதை தடுத்து மற்றும் யக்னா பலனை அடையாமல் செய்தனர் . எவர் ஒருவர் ஆரியர்கள் வழி சென்று அவர்களை பின்பற்றி நடந்தால் இராவணர் அவர்களுக்கு ' எமனாக ' ( Yama ) இருந்தார் . எனவே ஆரியர்கள் இதனை எதிர்க்க தங்களுடைய பலத்தை நிரூபிக்கும் வகையில் , விஸ்வாமித்திரர் ( Viswamitra ) மூலம் இராமனை தங்களுக்கு பக்க பலமாக வைத்துக் கொண்டனர் . அப்பொழுது இராமன் , சிறு வயதாக இருந்ததால் , பிரம்மா ஞானம் பற்றி அறியாத வயதில் , ஆரிய குலத்தை காப்பாற்றுவதாக எண்ணி இராவணனின் ஆதரவாளர்களை கொன்றார் . ஆரியர்களுக்கும் , திராவிடர்களுக்கும் உள்ள பகையானது இராமன் பிறப்பிற்கு முன்பே இருந்தது . இராமன் அவதரித்த பிறகு மேலும் அது தீவிரம் அடைந்தது . ஆனால் இதைப் பற்றி எந்த ஒரு சரித்திர புத்தகங்களும் கூறவில்லை . 
<br><br>
 இராமாயண காவியத்தை ஒரு புத்தகமாக எழுதியவர் வால்மிகி ஆவார் . அவர் ஆரிய குலத்தை சேர்ந்தவர் . இதனாலேயே இராவணனை ஒரு மோசமான தீய நபர் என்று சித்தரித்தார் . இராவணர் சீதா தேவியை இலங்கைக்கு எடுத்துச் சென்றது என்னவோ உண்மைதான் ஆனால் அதனுடைய உள் அர்த்தம் என்ன வென்று புரியாமல் யோசித்தோம் என்றால் , அவர் நமக்கு தீய மனிதராகவே தெரிவார் . இராவணரோ முக்காலமும் உணர்ந்த ஞானி ( Trikala Gnani Past , present , future ) , எனவே அவருடைய மரணமானது இராமனுடைய கையில் தான் உள்ளது என்பதை அவர் அறிந்து வைத்திருந்தார் . இதன் காரணமாகவே சீதையை இலங்கைக்கு கொண்டுவர காரணம் என்று தம்முடைய மனைவி மண்டோதரிக்கு தெரிவித்து இருந்தார் . ஆனால் ஆரியர்கள் இவற்றை எல்லாம் அறிந்தும் , அதனை மறைத்து இராவணரை ஒரு நெறி கெட்டவராக சித்தரித்து உள்ளனர் . சீதையை கடத்திய பொழுது , இராவணனுடைய வயது " என்பது " ( 80 ) ஆகும் . சீதையை 50 கிலோமீட்டர் தொலைவில் ( தம் இருப்பிடத்தில் இருந்து ) , 20 பணியாளர்கள் அமர்த்தி ஒர் அமைதியான , அழகான சூழலில் அவரை வைத்திருந்தார் . இராவணன் ஒவ்வொரு வாரமும் தம்டைய மனைவியோடு சீதையை பார்த்து , அவர் நலம் விசாரித்து வருவார் . இராவணர் சீதையிடமே அவர் இனி எதிர்காலத்தில் நடக்கப்போவது என்னவென்று கூறியிருந்தார் . இராமன் எப்பொழுது வருவார் , அவர் எப்படிப்பட்டவர் என்பதை எல்லாம் சீதையிடம் ஒரு தந்தையை போன்ற உணர்வுடன் அவரிடத்தில் கூறியிருந்தார் . இதனை எல்லாம் கவனித்த சீதை இராவணரை ஒரு " மகான் " என்று நினைத்தார் . அவரைப் பற்றி ஒரு பொழுதும் கெட்டவராக சீதை கூறியது இல்லை . பிற்காலத்தில் " வால்மிகி " முனிவரின் ஆசிரமத்தில் பதினொரு ஆண்டுகள் இருந்த பொழுது சீதை பல இன்னல்களை சந்தித்தார் . அப்பொழுது அசோகவனத்தில் இராவணரின் பாதுகாப்பில் இருந்த நிம்மதியை , அவரால் வால்மிகி முனிவரின் ஆசிரமத்தில் உணர முடியவில்லை . 
 <br><br>
 இப்படிப்பட்ட நல்ல குணம் கொண்ட இராவணனை , இராமாயண காவியத்தில் கெட்டவராக சித்தரித்து காட்டினர் . முக்காலமும் உணர்ந்த ஒருவனால் நீதி , நேர்மை , தர்மம் போன்றவைகள் பற்றி தெரியாதா என்ன ? ஆனால் ஆர்ய கவிஞர்களோ இராவணனை மிக மோசமாக சித்தரித்து காட்டிவிட்டனர் . இன்று வரை கூட மக்கள் இராவணனை ஒரு நெறி கெட்ட நீதி தவறியவராகவே கருதுகின்றனர் , பல தரப்பட்ட அறிஞர்கள் , படித்தவர்கள் , படிக்காதவர்கள் , புத்தி கூர்மை உடையவர்கள் என எல்லோரும் ஒரே சாரமாக இராவணனை கீழ்த்தரமாக சித்தரிக்கப்பட்ட மனிதராக பாவிக்கின்றனர் . 
 <br><br>
 இதனால் தான் என்னவோ , தெய்வீக சக்தி கொண்ட பெருங்கடல் , இராவணனை கேவலமாக சித்தரித்து கூறியதால் சினங்கொண்டு இந்தியப் பெருங்கடலை விட்டு அட்லாண்டிக் சமுத்திரத்திற்கு சென்றது . அங்கு " பெர்முடா முக்கோணம் " என்ற பெயர் பெற்று , அவ்விடத்தை கடக்கும் பொழுது விபத்துகளும் , விமானக்கடத்தல்களும் ஏற்படுகின்றன . அவை சில மனிதர்களை வேற்று கிரகங்களுக்கு அனுப்பி தெய்வீக ஞானத்தை பெற வழி செய்கின்றன . அவர்களே ஞானிகள் ஆவார் . மேகங்கள் ஆனது அவ்விடத்தை கடக்கும் பொழுது   ஒரு வித சக்தியை பெறுகின்றன , அந்த மேகங்களே மனிதர்கள் பூமியில் வாழ்வதற்கு வழி செய்கின்றன . தெய்வ சக்தியை இக்கால அறிவியலால் உணர முடியாது , பிரம்ம சாஸ்திரததை கொண்டு மட்டுமே மிகவும் சரியான விளக்கம் தரமுடியும் . 
 <br><br>
 அக்காலத்தில் இலங்கை மக்களுக்கு தெய்வீக அறிவு பற்றி நன்கு தெரிந்திருந்தது . ஆனால் கெட்ட சக்திகள் பற்றி அவர்கள் அறியவில்லை . ஆங்கிலத்தில் " Sri Lanka " என்ற பெயரில் " Sri " என்பது மோட்சம் என்று பொருள் , அந்நாட்டு மக்கள் நல்ல தெய்வீக அறிவு பெற்றதால் பிரம்மாவின் வம்சாவழிகள் அங்கு வாழ்ந்து வருகின்றனர் . அவர்கள் இன்றும் சிங்கள உச்சரிப்பில் தெலுங்கு மொழி பேசுகின்றனர் . ஆனால் அவர்கள் நாடோடிகள் என்று அழைக்கப்படுகிறார்கள் . இராவணன் ஆட்சி காலத்தில் எல்லா மக்களும் தெலுங்கு மொழி பேசி வாழ்ந்து வந்தனர் . இராவண பிரம்மா காலத்திலேயே தெலுங்கு பேசப்பட்டதால் , அம்மொழியின் பழமையும் , பெருமையும் பற்றி அறியலாம் . இன்றும் கூட அம்மக்கள் இராவண பிரம்மாவை கடவுளாக வழிபடுகின்றனர் . அவரை ஒரு ராட்சசனாக அவர்கள் ஏற்றுக்கொள்ளவில்லை . நாமும் அதை ஒப்புக்கொண்டு தான் ஆக வேண்டும் . இவ்வுலகம் தோன்றிய பொழுது கடவுள் , ' சூரியனுக்கு தான் தெய்வீக ஞானத்தை பற்றி கற்பித்தார் . பின்னர் அது " மனு ( Manu ) விற்கு சொல்லப்பட்டது . பின்னர் அங்கிருந்த உலகம் முழுவதும் பரவியது . அந்த முறையான தெய்வீக ஞான அறிவைத் தான் இராவணன் பெற்றிருந்தார் . இதனாலேயே என்னவோ ஆரியர்கள் இராவணனை வேறு விதமாக கெட்ட பாடச்சனாக சித்தரித்துவிட்டனர் . இன்றும்கூட இலங்கையில் உள்ள மக்கள் பலர் , இராவணன் ஒர் உண்மையான , தைரியமான பலசாலி என்றும் , அவருக்கு இறப்பு என்பதே இல்லை என்றும் , அவர் மீண்டும் உயிர்வித்து வருவார் என்றும் நம்புகின்றனர் . இராமனுக்கும் , இராவணருக்கும் இடையே நடந்த போரில் எந்த ஒரு விலங்கினமான குரங்கோ , கரடியோ அல்லது வேறு மிருகங்களோ பங்கேற்கவில்லை , ஆனால் இதனையும் ஆரியர்கள் வரலாற்றில் புகுத்திவிட்டனர் என்று அம்மக்கள் கூறுகின்றனர் . 
 <br><br>
  பண்டைய காலத்து இந்தியாவில் திராவிடர்களே நாடு முழுவதும் வாழ்ந்து வந்ததாக வரலாற்று சான்றுகள் தெரிவிக்கின்றன . ஆனால் சில காலங்கள் கழித்து , மத்திய ஆசியாவில் இருந்து , பஞ்சம் பிழைக்க பலர் தங்களுடைய இடங்களை விட்டு , இங்கு வரத் தொடங்கினர் . அதன் பிறகு காலங்கள் செல்லச் செல்ல ஆரியர்களே மிகவும் நயவஞ்சகமாக , நம் மக்களை ஏமாற்றி பல ராஜ்ஜியங்களை கைப்பற்ற தொடங்கினர் . இப்படிப்பட்ட சுய பக்கங்களை கொண்டவர்கள் தான் ஆரியர்கள் என்று கூறுகிறோம் . இந்த ஆரியர்களின் சூழ்ச்சியால் தான் , திராவிடர்கள் தம் சுதந்திர ஆட்சியை இழந்து , ஞான சக்தியையும் இழந்து , அவர்களுடைய வலையில் வீழ்ந்து சரியத் தொடங்கினர் . எனவே திராவிடர்கள் தங்களுடைய நம்பிக்கையை இழந்து அழிவை நோக்கி சென்றனர் . 
 <br><br>
 இலங்கையில் இன்றும் கூட இராவண பிரம்மாவின் ஆட்சியையும் , அவரின் நெறிகளையும் பின்பற்றும் மக்கள் , அவர் மீண்டும் வருவார் , நல்லாட்சி புரிவார் என்றும் நம்பிக்கையோடு வாழ்ந்து கொண்டிருக்கின்றனர் . நாமும் இதே நம்பிக்கையோடு , பெர்முடா முக்கோணத்தில் உள்ள சக்தியை போன்று , மீண்டும் இராவணன் அவதாரம் எடுத்து வருவார் என்றும் , அவர் ஜீவாத்மா அல்ல , அவருக்கு இறப்பு என்பதே இல்லை என்றும் கூறலாம் . இதன் மூலம் இராவண பிரம்மாவை பற்றிய தவறான கருத்து விலகுவதோடு , அவர் ஓர் முழுமையான தெய்வ ஞானி என்றும் , தீய குணங்கள் இல்லாத ஓர் உண்மையான பிராமணர் என்றும் மற்றும் சாதாரண மனிதர் அல்ல . ஆனால் அவர் கடவுளின் அவதாரம் என்றும் . பகவான் மற்றும் யோகீஸ்வரா என்றும் கூறலாம் . 
 <br><br>
 மதிப்புரையாளர்கள் <br>
 சந்திர மோகன் ப.ர MCA , <br>
 இரமேஷ் பெ B.E , MBA . <br>
 <br><br>
 இப்படிக்கு <br><br>
 இராவண பிரம்மா திராவிட பிராம்ஹன சங்கம் 
</p>
  `},
    {
      text: ` 
    <ion-row>
    <ion-col class="ion-text-center">
    <h1> சங்கத்தின் முக்கிய நோக்கம் </h1>
    </ion-col>
    </ion-row>
    <ion-row>
    <ion-col>
    1. "விஷ்வத்தை சிருஷ்டி கர்த்தாவான கடவுள் எல்லோருக்கும் ஒருவர்தான்" இந்த சத்தியத்தை அனைத்து மக்களுக்கும் தெரியப்படுத்துதல்.
    <br><br>
    2. கடவுளுடைய ஞானம் பிரம்மவித்யா சாஸ்திரம் என்பதால் தெய்வ கிரந்தத்தில்  உள்ள  தர்மங்களை விஸ்வம் எல்லாம் பிரச்சாரம் செய்வது.
    <br><br>
    3. தெய்வக் ஞானி, திரிகால ஞானி, அப்பரப்பிரம்மா, பஹூமுக ஞான புத்தி கொண்டவர், மூன்று யோகங்கள், மூன்று ஆத்மஞானம் தெரிந்த யோகீஈஸ்வரர், ஆதி (திராவிட) பிராமணன், திராவிட ஈஸ்வரர்ரான ராவண பிரம்மா பெருந்தன்மையை சமூகத்திற்கு தெரியப்படுத்துதல்.
    <br><br>
    4. திரிகால ஞானி, அப்பரப்பிரம்மஸ்ரீ ராவணப்பிரம்மா மீது, இப்போது வரை உள்ள மோசமான பிரச்சாரத்தை திருப்பி அடித்தல்.
    <br><br>
    5. திராவிட என்னும் வார்த்தையில் த்ரைத சித்தாந்தமான மூன்று ஆத்மா விவரங்கள் உள்ளது என்றும் திரா, வி, ட என்னும் எழுத்துக்களில் பரமாத்மா, ஆத்மா மற்றும் ஜீவாத்மாக்களை குறிக்கின்றது என்று தெரியப்படுத்துதல்.
    <br><br>
    6. திராவிட என்னும் வார்த்தைக்கு உண்மையான அர்த்தத்தை தெரிவித்து, குறைந்துபோன திராவிடர்களை  முழுமையாக மறு சீரமைப்பு செய்வது.  
    <br><br>
    7. பிரம்மஞானம் தெரிந்தவர்கள் உண்மையான பிராமணர்கள் என்னும் சத்தியத்தை சமூகத்திற்கு தெரியப்படுத்தல்.
    <br><br>
    8.  பிரம்மவித்யா சாஸ்திரத்தில் தெய்வ ஞானம் ஆதாரத்தில் எல்லா மதத்தில் உள்ளவர்களை ஒருங்கிணைத்தல்.
    <br><br>
    9. கடவுளுக்கு, பகவானுக்கு, உள்ள வித்தியாசத்தை தெரியப்படுத்துதல்.
    <br><br>
    10. கடவுள் மனிதன் (பகவானாக) வரலாம் மேலும், மனிதன் மோக்ஷம் அடையும் வரை கடவுளாக மாட்டான் என்று சமூகத்திற்கு அர்த்தம் புரிதல்.
    <br><br>
    11. பிரம்மவித்யா சாஸ்திரத்தில் வாக்கியத்தில் கடவுள் விதானம் எண்ணம் விவரித்து சொல்லுதல்.
    <br><br>
    12. பிரம்ம வித்யா சாஸ்திரம் அத்தியாயனம், பயிற்சி பிரகாரம் கர்மத்தை இல்லாமல் செய்வதற்கு உள்ளது என்று தெரியப்படுத்துதல்.
    <br><br>
    13. வேதங்கள், புராணங்கள், இதிகாசங்கள் இவையெல்லாம் பொழுதுபோக்குக்காக உள்ளது என்று தெரியப்படுத்துதல்.
    <br><br>
    14. பிரம்மவித்யா சாஸ்திரத்தில் உள்ள தர்மங்கள் தெய்வ தர்மங்கள் என்னும், அது ஒவ்வொரு மனிதனுக்கு சம்பந்தப்பட்டது என்றும், பயிற்சிக்கு சுலபமானது என்றும் தெரியப்படுத்துதல்.
    <br><br>
    15. அதர்மங்கள் நான்கு என்னும், மூன்று மட்டும் தர்மங்கள் என்னும், தர்மத்தை அனுசரிப்பது முக்திக்கு மார்க்கம் என்னும் அதே மனிதன் முக்கிய நோக்கம் ஆக வேண்டும் என்றும் தெரிவிப்பது. (பகவத்கீதையில் விஸ்வரூப சன்தர்ஸ்ன யோகம் 48,53 சுலோகங்கள்).
    <br><br>
    16. மனிதன் ஜென்மம் முக்கிய விதானத்தை தெரிவித்து, தான் சேரவேண்டிய இறுதி மார்க்கம் மோக்ஷம் தான் என்னும், மோக்ஷம் மார்க்கத்தில் நடந்த போது மனிதன் ஜென்மம் உயர்ந்த ஜென்மம் ஆனது என்று தெரிவிப்பது.
    <br><br>
    17. மூன்று பாகமாக  உள்ள தெய்வ கிரந்தத்தில் ஞான விஷயத்தை சம்பூரணமாக தெரிந்தவர் உண்மையான ஆத்மஞானி ஆவார் என்றும் சமூகத்திற்கு தெரியப்படுத்துதல்.
    <br><br>
    18. பிரம்மவித்யா சாஸ்திரத்தில் உலகத்தில் இந்த புத்தகங்களில் (வேதங்கள், புராணங்கள், உபநிஷத்துக்கள் ) உடன் சரி சமமாக ஒப்பிடாமல் பார்ப்பது.
    <br><br>
    19.  பிரம்மவித்யா சாஸ்திரத்தில் எதிர்ப்பின்றி மற்றும் கேள்வி மீதி இல்லாமல் தெய்வ ஞானத்தை சமூகத்திற்கு தெரியப்படுத்தி, எல்லோரும் பிராமன்ணியத்தை அடையும்படி செய்தல்.
    <br><br>
    20. பிரம்மா என்றால் பெரியது என்றும், பிராமணன் என்றால் பெரியவர்  என்றும்  சிறிய வரை பெரியவராக செய்வது குறிக்கோளாக கொண்டு இருப்பது.
    </ion-col>
    </ion-row>
    `
    },
    {
      text: ` 
    <ion-row>
    <ion-col class="ion-text-center">
    <h1>Ravana Brahma Temples</h1>
    </ion-col>
    </ion-row>
    `
    },
    {
      text: ``
    },
    {
      text: ``
    },
    {
      text: ` 
    <ion-row>
    <ion-col class="ion-text-center">
    <h1>ராவணன் பிரம்மா பற்றி புனித நூல்</h1>
    </ion-col>
    </ion-row>

    <ion-row>
      <ion-col class="ion-text-center">
      <img  width="100%" src="assets/img/tamil/1.jpg" />  
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <ion-button fill="outline" shape="round"><a href="https://thraithashakam.org/publications/tamil/pdf/Brahma-Ravana-Brahma-Bhagavan-Ravana-Brahma-Tamil.pdf">வேதத்தை திறக்கவும்</a> </ion-button>
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <img  width="100%" src="assets/img/tamil/2.jpg" />  
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <ion-button fill="outline" shape="round"><a href="https://thraithashakam.org/publications/tamil/pdf/Dravida-Brahmana-Tamil.pdf">வேதத்தை திறக்கவும்</a> </ion-button>
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <img  width="100%" src="assets/img/tamil/3.jpg" />  
      </ion-col>
      </ion-row>
      <ion-row>
      <ion-col class="ion-text-center">
      <ion-button fill="outline" shape="round" ><a href="https://thraithashakam.org/publications/tamil/pdf/Thraithaakaara-Rahasyamu-Tamil.pdf">வேதத்தை திறக்கவும்</a> </ion-button>
      </ion-col>
      </ion-row>
    `
    }   
  ]


}
